;---------------------------------------------
;---           CONTINENT BONUSES           ---
;---------------------------------------------
[ContinentBonus_SafeCracker X2GameplayMutatorTemplate]
DisplayName="安全破解"
SummaryText="保险箱解密所需时间减少50%。"

[ContinentBonus_ProwlersProfit X2GameplayMutatorTemplate]
DisplayName="盗贼之利"
SummaryText="保险箱的战利品总是有高级或者中级部件。"

[ContinentBonus_HelpingHand X2GameplayMutatorTemplate]
DisplayName="帮手"
SummaryText="增加一个工程师。"

[ContinentBonus_SignalFlare X2GameplayMutatorTemplate]
DisplayName="闪耀信号"
SummaryText="增加一个反抗军通讯.."

[ContinentBonus_Xenobiology X2GameplayMutatorTemplate]
DisplayName="外星生物学"
SummaryText="解剖立即完成。"

;---------------------------------------------
;---      SPARK UPGRADES && ABILITIES      ---
;---------------------------------------------

[GrimyOverdriveOne X2AbilityTemplate]
LocFriendlyName="超频"
LocLongDescription="本回合4个行动点。多次一般射击会有减益。"
LocHelpText="本回合4个行动点。多次一般射击会有减益。"

[GrimyOverdriveTwo X2AbilityTemplate]
LocFriendlyName="高级超频"
LocLongDescription="本回合4个行动点。多次一般射击会有减益。"
LocHelpText="本回合4个行动点。多次一般射击会有减益。"

[GrimyOverdriveThree X2AbilityTemplate]
LocFriendlyName="终极超频"
LocLongDescription="本回合4个行动点。多次一般射击会有减益。"
LocHelpText="本回合4个行动点。多次一般射击会有减益。"

[GrimySpotter_BscBit X2WeaponUpgradeTemplate]
FriendlyName="标记协议"
FriendlyNamePlural="标记协议"
BriefSummary="恐吓会标记敌人2回合。"
TinySummary="恐吓会标记敌人"
LootTooltip="让我们的 Spark 恐吓敌人吧。"

[GrimySpotter_AdvBit X2WeaponUpgradeTemplate]
FriendlyName="高级标记协议"
FriendlyNamePlural="高级标记协议"
BriefSummary="恐吓会标记敌人3回合。"
TinySummary="恐吓会标记敌人"
LootTooltip="让我们的 Spark 恐吓敌人吧。"

[GrimySpotter_SupBit X2WeaponUpgradeTemplate]
FriendlyName="终级标记协议"
FriendlyNamePlural="终级标记协议"
BriefSummary="恐吓会标记敌人4回合。"
TinySummary="恐吓会标记敌人"
LootTooltip="让我们的 Spark 恐吓敌人吧。"

[GrimySurvival_BscBit X2WeaponUpgradeTemplate]
FriendlyName="生存协议"
FriendlyNamePlural="生存协议"
BriefSummary="恐吓提供1点防护，持续2回合。"
TinySummary="恐吓提供防护"
LootTooltip="提供反应防护。"

[GrimySurvival_AdvBit X2WeaponUpgradeTemplate]
FriendlyName="高级生存协议"
FriendlyNamePlural="高级生存协议"
BriefSummary="恐吓提供2点防护，持续2回合。"
TinySummary="恐吓提供防护"
LootTooltip="提供反应防护。"

[GrimySurvival_SupBit X2WeaponUpgradeTemplate]
FriendlyName="终级生存协议"
FriendlyNamePlural="终级生存协议"
BriefSummary="恐吓提供3点防护，持续2回合。"
TinySummary="恐吓提供防护"
LootTooltip="提供反应防护。"

[GrimyRepair_BscBit X2WeaponUpgradeTemplate]
FriendlyName="维修协议"
FriendlyNamePlural="维修协议"
BriefSummary="修复次数+1"
TinySummary="提高修复次数"
LootTooltip="战场上可以进行更多的修复。"

[GrimyRepair_AdvBit X2WeaponUpgradeTemplate]
FriendlyName="高级维修协议"
FriendlyNamePlural="高级维修协议"
BriefSummary="修复次数+2"
TinySummary="提高修复次数"
LootTooltip="战场上可以进行更多的修复。"

[GrimyRepair_SupBit X2WeaponUpgradeTemplate]
FriendlyName="终极维修协议"
FriendlyNamePlural="终极维修协议"
BriefSummary="修复次数+3"
TinySummary="提高修复次数"
LootTooltip="战场上可以进行更多的修复。"

[GrimySparkRocket_BscBit X2WeaponUpgradeTemplate]
FriendlyName="预存火箭"
FriendlyNamePlural="预存火箭"
BriefSummary="火箭发射器使用次数+1。"
TinySummary="增加火箭发射器使用次数"
LootTooltip="提供预存的火箭发射器。"

[GrimySparkRocket_AdvBit X2WeaponUpgradeTemplate]
FriendlyName="高级预存火箭"
FriendlyNamePlural="高级预存火箭"
BriefSummary="火箭发射器使用次数+1，伤害+1。"
TinySummary="增加火箭发射器使用次数"
LootTooltip="提供预存的火箭发射器。"

[GrimySparkRocket_SupBit X2WeaponUpgradeTemplate]
FriendlyName="终级预存火箭"
FriendlyNamePlural="终级预存火箭"
BriefSummary="火箭弹使用次数+1，火箭弹伤害+2。"
TinySummary="增加火箭弹使用次数"
LootTooltip="提供预存的火箭弹。"

[GrimySparkShredder_BscBit X2WeaponUpgradeTemplate]
FriendlyName="预存榴散弹"
FriendlyNamePlural="预存榴散弹"
BriefSummary="粉碎炮使用次数+1"
TinySummary="增加粉碎炮使用次数"
LootTooltip="提供预存的粉碎炮。"

[GrimySparkShredder_AdvBit X2WeaponUpgradeTemplate]
FriendlyName="高级预存榴散弹"
FriendlyNamePlural="高级预存榴散弹"
BriefSummary="粉碎炮使用次数+1，范围+2"
TinySummary="增加粉碎炮使用次数"
LootTooltip="提供预存的粉碎炮。"

[GrimySparkShredder_SupBit X2WeaponUpgradeTemplate]
FriendlyName="终级预存榴散弹"
FriendlyNamePlural="终级预存榴散弹"
BriefSummary="粉碎炮使用次数+1，范围+4"
TinySummary="增加粉碎炮使用次数"
LootTooltip="提供预存的粉碎炮。"

[GrimySparkFlamethrower_BscBit X2WeaponUpgradeTemplate]
FriendlyName="凝固汽油"
FriendlyNamePlural="凝固汽油"
BriefSummary="火焰喷射器使用次数+1。"
TinySummary="增加火焰喷射器使用次数"
LootTooltip="提供预存的火焰喷射器。"

[GrimySparkFlamethrower_AdvBit X2WeaponUpgradeTemplate]
FriendlyName="高级凝固汽油"
FriendlyNamePlural="高级凝固汽油"
BriefSummary="火焰喷射器使用次数+1，直径+1。"
TinySummary="增加火焰喷射器使用次数"
LootTooltip="提供预存的火焰喷射器。"

[GrimySparkFlamethrower_SupBit X2WeaponUpgradeTemplate]
FriendlyName="终极凝固汽油"
FriendlyNamePlural="终极凝固汽油"
BriefSummary="火焰喷射器使用次数+1，直径+2。"
TinySummary="增加火焰喷射器使用次数"
LootTooltip="提供预存的火焰喷射器。"

[GrimySparkBlasterLauncher_BscBit X2WeaponUpgradeTemplate]
FriendlyName="预存超铀"
FriendlyNamePlural="预存超铀"
BriefSummary="爆裂炮使用次数 +1。"
TinySummary="增加爆裂炮使用次数"
LootTooltip="提供预存的爆裂炮弹。"

[GrimySparkBlasterLauncher_AdvBit X2WeaponUpgradeTemplate]
FriendlyName="高级预存超铀"
FriendlyNamePlural="高级预存超铀"
BriefSummary="爆裂炮使用次数 +1，伤害+1。"
TinySummary="增加爆裂炮使用次数"
LootTooltip="提供预存的爆裂炮弹。"

[GrimySparkBlasterLauncher_SupBit X2WeaponUpgradeTemplate]
FriendlyName="终级预存超铀"
FriendlyNamePlural="终级预存超铀"
BriefSummary="爆裂炮使用次数 +1，伤害+2。"
TinySummary="增加爆裂炮使用次数"
LootTooltip="提供预存的爆裂炮弹。"

[GrimySparkPlasmaBlaster_BscBit X2WeaponUpgradeTemplate]
FriendlyName="预存电浆"
FriendlyNamePlural="预存电浆"
BriefSummary="电浆毁灭炮使用次数+1。"
TinySummary="增加电浆毁灭炮使用次数"
LootTooltip="提供预存的电浆毁灭炮弹。"

[GrimySparkPlasmaBlaster_AdvBit X2WeaponUpgradeTemplate]
FriendlyName="高级预存电浆"
FriendlyNamePlural="高级预存电浆"
BriefSummary="电浆毁灭炮使用次数+1，宽度+1。"
TinySummary="增加电浆毁灭炮使用次数"
LootTooltip="提供预存的电浆毁灭炮弹。"

[GrimySparkPlasmaBlaster_SupBit X2WeaponUpgradeTemplate]
FriendlyName="终级预存电浆"
FriendlyNamePlural="终级预存电浆"
BriefSummary="电浆毁灭炮使用次数+1，宽度+2。"
TinySummary="增加电浆毁灭炮使用次数"
LootTooltip="提供预存的电浆毁灭炮弹。"

[GrimySparkNova_BscBit X2WeaponUpgradeTemplate]
FriendlyName="爆发协议"
FriendlyNamePlural="爆发协议"
BriefSummary="新星伤害+3。"
TinySummary="增加新星伤害"
LootTooltip="增加Spark的新星能力。"

[GrimySparkNova_AdvBit X2WeaponUpgradeTemplate]
FriendlyName="高级爆发协议"
FriendlyNamePlural="高级爆发协议"
BriefSummary="新星伤害+4。"
TinySummary="增加新星伤害"
LootTooltip="增加Spark的新星能力。"

[GrimySparkNova_SupBit X2WeaponUpgradeTemplate]
FriendlyName="终极爆发协议"
FriendlyNamePlural="终极爆发协议"
BriefSummary="新星伤害+5。"
TinySummary="增加新星伤害"
LootTooltip="增加Spark的新星能力。"

[GrimySparkMartyr_BscBit X2WeaponUpgradeTemplate]
FriendlyName="烈士协议"
FriendlyNamePlural="烈士协议"
BriefSummary="减少牺牲所受伤害 40%。"
TinySummary="增加牺牲的生存能力"
LootTooltip="帮助Sparks在保护友军时生存。"

[GrimySparkMartyr_AdvBit X2WeaponUpgradeTemplate]
FriendlyName="高级烈士协议"
FriendlyNamePlural="高级烈士协议"
BriefSummary="减少牺牲所受伤害 50%。"
TinySummary="增加牺牲的生存能力"
LootTooltip="帮助Sparks在保护友军时生存。"

[GrimySparkMartyr_SupBit X2WeaponUpgradeTemplate]
FriendlyName="终极烈士协议"
FriendlyNamePlural="终极烈士协议"
BriefSummary="减少牺牲所受伤害 60%。"
TinySummary="增加牺牲的生存能力"
LootTooltip="帮助Sparks在保护友军时生存。"

[GrimySparkBombard_BscBit X2WeaponUpgradeTemplate]
FriendlyName="围攻协议"
FriendlyNamePlural="围攻协议"
BriefSummary="密集轰炸 +1。"
TinySummary="增加密集轰炸使用次数"
LootTooltip="spark可以更频繁的密集轰炸。"

[GrimySparkBombard_AdvBit X2WeaponUpgradeTemplate]
FriendlyName="高级围攻协议"
FriendlyNamePlural="高级围攻协议"
BriefSummary="密集轰炸 +2。"
TinySummary="增加密集轰炸使用次数"
LootTooltip="spark可以更频繁的密集轰炸。"

[GrimySparkBombard_SupBit X2WeaponUpgradeTemplate]
FriendlyName="终极围攻协议"
FriendlyNamePlural="终极围攻协议"
BriefSummary="密集轰炸 +3。"
TinySummary="增加密集轰炸使用次数"
LootTooltip="spark可以更频繁的密集轰炸。"

[GrimySparkOverclock_BscBit X2WeaponUpgradeTemplate]
FriendlyName="超频协议"
FriendlyNamePlural="超频协议"
BriefSummary="提供 1 次超频能力。"
TinySummary="增强极限超载"
LootTooltip="提供超频能力，一种特殊的极限超载形式，提供4个行动点。"

[GrimySparkOverclock_AdvBit X2WeaponUpgradeTemplate]
FriendlyName="高级超频协议"
FriendlyNamePlural="高级超频协议"
BriefSummary="提供 2 次超频能力。"
TinySummary="增强极限超载"
LootTooltip="提供超频能力，一种特殊的极限超载形式，提供4个行动点。"

[GrimySparkOverclock_SupBit X2WeaponUpgradeTemplate]
FriendlyName="终极超频协议"
FriendlyNamePlural="终极超频协议"
BriefSummary="提供 3 次超频能力。"
TinySummary="增强极限超载"
LootTooltip="提供超频能力，一种特殊的极限超载形式，提供4个行动点。"

[GrimySparkTrojan_BscBit X2WeaponUpgradeTemplate]
FriendlyName="斯巴达协议"
FriendlyNamePlural="斯巴达协议"
BriefSummary="增加50骇客能力。"
TinySummary="增加骇客能力"
LootTooltip="Spark Bit可以远程骇入。"

[GrimySparkTrojan_AdvBit X2WeaponUpgradeTemplate]
FriendlyName="高级斯巴达协议"
FriendlyNamePlural="高级斯巴达协议"
BriefSummary="增加70骇客能力。"
TinySummary="增加骇客能力"
LootTooltip="Spark Bit可以远程骇入。"

[GrimySparkTrojan_SupBit X2WeaponUpgradeTemplate]
FriendlyName="终极斯巴达协议"
FriendlyNamePlural="终极斯巴达协议"
BriefSummary="增加90骇客能力。"
TinySummary="增加骇客能力"
LootTooltip="Spark Bit可以远程骇入。"

[GrimyNorthStar_BscArmor X2WeaponUpgradeTemplate]
FriendlyName="北极星"
FriendlyNamePlural="北极星"
BriefSummary="减少突袭冷却2回合。"
TinySummary="减少突袭冷却"
LootTooltip="Spark 可以更频繁近战了。"

[GrimyNorthStar_AdvArmor X2WeaponUpgradeTemplate]
FriendlyName="高级北极星"
FriendlyNamePlural="高级北极星"
BriefSummary="减少突袭冷却3回合。"
TinySummary="减少突袭冷却"
LootTooltip="Spark 可以更频繁近战了。"

[GrimyNorthStar_SupArmor X2WeaponUpgradeTemplate]
FriendlyName="终极北极星"
FriendlyNamePlural="终极北极星"
BriefSummary="减少突袭冷却4回合。"
TinySummary="减少突袭冷却"
LootTooltip="Spark 可以更频繁近战了。"

[GrimyStranglehold_BscArmor X2WeaponUpgradeTemplate]
FriendlyName="束缚"
FriendlyNamePlural="束缚"
BriefSummary="突袭至晕敌人，自身防御+20。"
TinySummary="增强突袭能力"
LootTooltip="Spark有机会暂时制服敌人了。"

[GrimyStranglehold_AdvArmor X2WeaponUpgradeTemplate]
FriendlyName="高级束缚"
FriendlyNamePlural="高级束缚"
BriefSummary="突袭至晕敌人，自身防御+25。"
TinySummary="增强突袭能力"
LootTooltip="Spark有机会暂时制服敌人了。"

[GrimyStranglehold_SupArmor X2WeaponUpgradeTemplate]
FriendlyName="终极束缚"
FriendlyNamePlural="终极束缚"
BriefSummary="突袭至晕敌人，自身防御+30。"
TinySummary="增强突袭能力"
LootTooltip="Spark有机会暂时制服敌人了。"

[GrimyArmServos_BscArmor X2WeaponUpgradeTemplate]
FriendlyName="破甲"
FriendlyNamePlural="破甲"
BriefSummary="突袭伤害 +1。"
TinySummary="增强突袭伤害"
LootTooltip="Spark 近战更厉害了。"

[GrimyArmServos_AdvArmor X2WeaponUpgradeTemplate]
FriendlyName="高级破甲"
FriendlyNamePlural="高级破甲"
BriefSummary="突袭伤害 +2。"
TinySummary="增强突袭伤害"
LootTooltip="Spark 近战更厉害了。"

[GrimyArmServos_SupArmor X2WeaponUpgradeTemplate]
FriendlyName="终极破甲"
FriendlyNamePlural="终极破甲"
BriefSummary="突袭伤害 +3。"
TinySummary="增强突袭伤害"
LootTooltip="Spark 近战更厉害了。"

[GrimyShockAbsorbent_BscArmor X2WeaponUpgradeTemplate]
FriendlyName="吸震装甲"
FriendlyNamePlural="吸震装甲"
BriefSummary="4格内的敌人伤害 -30%。"
TinySummary="降低附近敌人的伤害"
LootTooltip="小范围保护"

[GrimyShockAbsorbent_AdvArmor X2WeaponUpgradeTemplate]
FriendlyName="高级吸震装甲"
FriendlyNamePlural="高级吸震装甲"
BriefSummary="4格内的敌人伤害 -35%。"
TinySummary="降低附近敌人的伤害"
LootTooltip="小范围保护"

[GrimyShockAbsorbent_SupArmor X2WeaponUpgradeTemplate]
FriendlyName="终极吸震装甲"
FriendlyNamePlural="终极吸震装甲"
BriefSummary="4格内的敌人伤害 -40%。"
TinySummary="降低附近敌人的伤害"
LootTooltip="小范围保护"

[GrimyBodyShield_BscArmor X2WeaponUpgradeTemplate]
FriendlyName="盾墙"
FriendlyNamePlural="盾墙"
BriefSummary="遭受视野内最近敌人攻击时防御 +15%。"
TinySummary="增强近距离防护"
LootTooltip="距离最近的敌人一面会增强防御能力。"

[GrimyBodyShield_AdvArmor X2WeaponUpgradeTemplate]
FriendlyName="高级盾墙"
FriendlyNamePlural="高级盾墙"
BriefSummary="遭受视野内最近敌人攻击时防御 +20%。"
TinySummary="增强近距离防护"
LootTooltip="距离最近的敌人一面会增强防御能力。"

[GrimyBodyShield_SupArmor X2WeaponUpgradeTemplate]
FriendlyName="终极盾墙"
FriendlyNamePlural="终极盾墙"
BriefSummary="遭受视野内最近敌人攻击时防御 +25%。"
TinySummary="增强近距离防护"
LootTooltip="距离最近的敌人一面会增强防御能力。"

[GrimyFireSuit X2WeaponUpgradeTemplate]
FriendlyName="防火背心"
FriendlyNamePlural="防火背心"
BriefSummary="燃烧效果无效"
TinySummary="燃烧效果无效"
LootTooltip="燃烧效果无效"

[GrimyPoisonSuit X2WeaponUpgradeTemplate]
FriendlyName="防毒背心"
FriendlyNamePlural="防毒背心"
BriefSummary="中毒效果无效"
TinySummary="中毒效果无效"
LootTooltip="中毒效果无效"

[GrimyAcidSuit X2WeaponUpgradeTemplate]
FriendlyName="防酸背心"
FriendlyNamePlural="防酸背心"
BriefSummary="酸性效果无效"
TinySummary="酸性效果无效"
LootTooltip="酸性效果无效"

;---------------------------------------------
;---     PRIMARY UPGRADES && ABILITIES     ---
;---------------------------------------------
[GrimyDodgePierce_Bsc X2WeaponUpgradeTemplate]
FriendlyName="智能弹道"
FriendlyNamePlural="智能弹道"
BriefSummary="降低擦伤几率 10%."
TinySummary="降低擦伤几率"
LootTooltip="武器可以增加射击擦伤几率。"

[GrimyDodgePierce_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级智能弹道"
FriendlyNamePlural="高级智能弹道"
BriefSummary="降低擦伤几率 20%."
TinySummary="降低擦伤几率"
LootTooltip="武器可以增加射击擦伤几率。"

[GrimyDodgePierce_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极智能弹道"
FriendlyNamePlural="终极智能弹道"
BriefSummary="降低擦伤几率 30%."
TinySummary="降低擦伤几率"
LootTooltip="武器可以增加射击擦伤几率。"

[GrimyScanner_Bsc X2WeaponUpgradeTemplate]
FriendlyName="人体扫描"
FriendlyNamePlural="人体扫描"
BriefSummary="增加视线范围1格"
TinySummary="增加视线范围"
LootTooltip="武器可以增加视线范围。"

[GrimyScanner_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级人体扫描"
FriendlyNamePlural="高级人体扫描"
BriefSummary="增加视线范围2格"
TinySummary="增加视线范围"
LootTooltip="武器可以增加视线范围。"

[GrimyScanner_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极人体扫描"
FriendlyNamePlural="终极人体扫描"
BriefSummary="增加视线范围3格"
TinySummary="增加视线范围"
LootTooltip="武器可以增加视线范围。"

[GrimyRedDot_Bsc X2WeaponUpgradeTemplate]
FriendlyName="红点瞄准"
FriendlyNamePlural="红点瞄准"
BriefSummary="侧面瞄准增加命中率和暴击率 5%."
TinySummary="侧面瞄准增加命中率和暴击率"
LootTooltip="武器侧面瞄准增加命中率和暴击率"

[GrimyRedDot_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级红点瞄准"
FriendlyNamePlural="高级红点瞄准"
BriefSummary="侧面瞄准增加命中率和暴击率 10%."
TinySummary="侧面瞄准增加命中率和暴击率"
LootTooltip="武器侧面瞄准增加命中率和暴击率"

[GrimyRedDot_Sup X2WeaponUpgradeTemplate]
FriendlyName="终级红点瞄准"
FriendlyNamePlural="终级红点瞄准"
BriefSummary="侧面瞄准增加命中率和暴击率 15%."
TinySummary="侧面瞄准增加命中率和暴击率"
LootTooltip="武器侧面瞄准增加命中率和暴击率"

[GrimyVitalPoint_Bsc X2WeaponUpgradeTemplate]
FriendlyName="要害瞄准"
FriendlyNamePlural="要害瞄准"
BriefSummary="提供致命射手能力"
TinySummary="致命射手"
LootTooltip="武器提供致命射手能力。"

[GrimyVitalPoint_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级要害瞄准"
FriendlyNamePlural="高级要害瞄准"
BriefSummary="提供致命射手能力，命中 +5%。"
TinySummary="致命射手，提升命中。"
LootTooltip="武器提供致命射手能力。"

[GrimyVitalPoint_Sup X2WeaponUpgradeTemplate]
FriendlyName="终级要害瞄准"
FriendlyNamePlural="终级要害瞄准"
BriefSummary="提供致命射手能力，命中 +10%。"
TinySummary="致命射手，提升命中。"
LootTooltip="武器提供致命射手能力。"

[GrimyHeavyFrame_Bsc X2WeaponUpgradeTemplate]
FriendlyName="重型支架"
FriendlyNamePlural="重型支架"
BriefSummary="伤害 +20%，移动 -2。"
TinySummary="增加伤害减少移动力"
LootTooltip="武器增加伤害减少移动力。"

[GrimyHeavyFrame_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级重型支架"
FriendlyNamePlural="高级重型支架"
BriefSummary="伤害 +25%，移动 -2。"
TinySummary="增加伤害减少移动力"
LootTooltip="武器增加伤害减少移动力。"

[GrimyHeavyFrame_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极重型支架"
FriendlyNamePlural="终极重型支架"
BriefSummary="伤害 +30%，移动 -2。"
TinySummary="增加伤害减少移动力"
LootTooltip="武器增加伤害减少移动力。"

[GrimyHangfire_Bsc X2WeaponUpgradeTemplate]
FriendlyName="延时引信"
FriendlyNamePlural="延时引信"
BriefSummary="伤害 +1，命中 -5%."
TinySummary="增加伤害减少命中"
LootTooltip="武器增加伤害减少命中。"

[GrimyHangfire_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级延时引信"
FriendlyNamePlural="高级延时引信"
BriefSummary="伤害 +2，命中 -10%."
TinySummary="增加伤害减少命中"
LootTooltip="武器增加伤害减少命中。"

[GrimyHangfire_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极延时引信"
FriendlyNamePlural="终极延时引信"
BriefSummary="伤害 +3，命中 -15%."
TinySummary="增加伤害减少命中"
LootTooltip="武器增加伤害减少命中。"

[GrimySuppressor_Bsc X2WeaponUpgradeTemplate]
FriendlyName="消声器"
FriendlyNamePlural="消声器"
BriefSummary="命中和暴击有15%几率不触发暴露。"
TinySummary="15% 几率暗影击杀"
LootTooltip="武器有几率命中和暴击而不触发暴露。"

[GrimySuppressor_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级消声器"
FriendlyNamePlural="高级消声器"
BriefSummary="命中和暴击有20%几率不触发暴露。"
TinySummary="20% 几率暗影击杀"
LootTooltip="武器有几率命中和暴击而不触发暴露。"

[GrimySuppressor_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极消声器"
FriendlyNamePlural="终极消声器"
BriefSummary="命中和暴击有25%几率不触发暴露。"
TinySummary="25% 几率暗影击杀"
LootTooltip="武器有几率命中和暴击而不触发暴露。"

[GrimyHeatSink_Bsc X2WeaponUpgradeTemplate]
FriendlyName="散热"
FriendlyNamePlural="散热"
BriefSummary="提供压制能力"
TinySummary="提供压制能力"
LootTooltip="武器提供压制能力"

[GrimyHeatSink_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级散热"
FriendlyNamePlural="高级散热"
BriefSummary="提供压制和破坏能力"
TinySummary="提供压制和破坏能力"
LootTooltip="武器提供压制和破坏能力"

[GrimyHeatSink_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极散热"
FriendlyNamePlural="终极散热"
BriefSummary="提供压制和破坏能力，外加 1 次杀戮地带的次数"
TinySummary="提供压制和破坏能力，外加 1 次杀戮地带的次数"
LootTooltip="武器提供压制和破坏能力，外加 1 次杀戮地带的次数"

[GrimyLightFrame_Bsc X2WeaponUpgradeTemplate]
FriendlyName="减重支架"
FriendlyNamePlural="减重支架"
BriefSummary="移动 +1，伤害 -15%。"
TinySummary="增加移动力减少伤害"
LootTooltip="武器增加移动力减少伤害。"

[GrimyLightFrame_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级减重支架"
FriendlyNamePlural="高级减重支架"
BriefSummary="移动 +2，伤害 -20%。"
TinySummary="增加移动力减少伤害"
LootTooltip="武器增加移动力减少伤害。"

[GrimyLightFrame_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极减重支架"
FriendlyNamePlural="终极减重支架"
BriefSummary="移动 +3，伤害 -25%。"
TinySummary="增加移动力减少伤害"
LootTooltip="武器增加移动力减少伤害。"

[GrimyKillZoneOne X2AbilityTemplate]
LocFriendlyName="杀戮地带"
LocHelpText="对圆锥范围内任意移动的敌人进行一次反应射击。"

[GrimyRunAndGunOne X2AbilityTemplate]
LocFriendlyName="奔袭战术"
LocHelpText="冲刺后行动。"

[GrimyRunAndGunTwo X2AbilityTemplate]
LocFriendlyName="奔袭战术"
LocHelpText="冲刺后行动。"

[GrimyRunAndGunThree X2AbilityTemplate]
LocFriendlyName="奔袭战术"
LocHelpText="冲刺后行动。"

[GrimyRapidFireOne X2AbilityTemplate]
LocFriendlyName="速射"
LocHelpText="连续朝一名敌人射击两次。每次射击受到<Ability:RAPIDFIREPENALTY/>的命中减益。"

[GrimyRapidFireTwo X2AbilityTemplate]
LocFriendlyName="速射"
LocHelpText="连续朝一名敌人射击两次。每次射击受到<Ability:RAPIDFIREPENALTY/>的命中减益。"

[GrimyRapidFireThree X2AbilityTemplate]
LocFriendlyName="速射"
LocHelpText="连续朝一名敌人射击两次。每次射击受到<Ability:RAPIDFIREPENALTY/>的命中减益。"

[GrimyHailOfBulletsOne X2AbilityTemplate]
LocFriendlyName="枪林弹雨"
LocHelpText="使用枪林弹雨可以保证击中目标，但需消耗大量弹药。"

[GrimyHailOfBulletsTwo X2AbilityTemplate]
LocFriendlyName="枪林弹雨"
LocHelpText="使用枪林弹雨可以保证击中目标，但需消耗大量弹药。"

[GrimySaturationFireOne X2AbilityTemplate]
LocFriendlyName="饱和射击"
LocHelpText="向一片圆锥形区域内的所有敌人发射密集炮火。"

[GrimySaturationFireTwo X2AbilityTemplate]
LocFriendlyName="饱和射击"
LocHelpText="向一片圆锥形区域内的所有敌人发射密集炮火。"

[GrimySaturationFireThree X2AbilityTemplate]
LocFriendlyName="饱和射击"
LocHelpText="向一片圆锥形区域内的所有敌人发射密集炮火。"

[GrimySerialOne X2AbilityTemplate]
LocFriendlyName="连环杀戮"
LocHelpText="强力的连环射击技能。每次用<Ability:WeaponName/>击杀敌人，都会返还行动点。"

[GrimySerialTwo X2AbilityTemplate]
LocFriendlyName="连环杀戮"
LocHelpText="强力的连环射击技能。每次用<Ability:WeaponName/>击杀敌人，都会返还行动点。"

[GrimySerialThree X2AbilityTemplate]
LocFriendlyName="连环杀戮"
LocHelpText="强力的连环射击技能。每次用<Ability:WeaponName/>击杀敌人，都会返还行动点。"

[GrimyFaceoffOne X2AbilityTemplate]
LocFriendlyName="对峙"
LocHelpText="使用手枪对每个可见敌人进行一次射击。"

[GrimyFaceoffTwo X2AbilityTemplate]
LocFriendlyName="对峙"
LocHelpText="使用手枪对每个可见敌人进行一次射击。"

[GrimyFaceoffThree X2AbilityTemplate]
LocFriendlyName="对峙"
LocHelpText="使用手枪对每个可见敌人进行一次射击。"

[GrimyFanFireOne X2AbilityTemplate]
LocFriendlyName="多重火力"
LocHelpText="对同一个目标射击三次。"

[GrimyFanFireTwo X2AbilityTemplate]
LocFriendlyName="多重火力"
LocHelpText="对同一个目标射击三次。"

[GrimyFanFireThree X2AbilityTemplate]
LocFriendlyName="多重火力"
LocHelpText="对同一个目标射击三次。"

[GrimyLightningHandsZero X2AbilityTemplate]
LocFriendlyName="雷霆之手"
LocHelpText="用手枪射击目标，此攻击不消耗行动点。"


[GrimyStabilizer_Bsc X2WeaponUpgradeTemplate]
FriendlyName="稳定制动"
FriendlyNamePlural="稳定制动"
BriefSummary="提供一次奔袭战术使用"
TinySummary="一次奔袭战术使用"
LootTooltip="武器部件提供一次奔袭战术使用"

[GrimyStabilizer_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级稳定制动"
FriendlyNamePlural="高级稳定制动"
BriefSummary="提供二次奔袭战术使用"
TinySummary="二次奔袭战术使用"
LootTooltip="武器部件提供二次奔袭战术使用"

[GrimyStabilizer_Sup X2WeaponUpgradeTemplate]
FriendlyName="稳定制动"
FriendlyNamePlural="稳定制动"
BriefSummary="提供三次奔袭战术使用"
TinySummary="三次奔袭战术使用"
LootTooltip="武器部件提供三次奔袭战术使用"

[GrimyProgressive_Bsc X2WeaponUpgradeTemplate]
FriendlyName="被动扳机"
FriendlyNamePlural="被动扳机"
BriefSummary="提供 1 次速射"
TinySummary="提供 1 次速射"
LootTooltip="武器部件提供 1 次速射"

[GrimyProgressive_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级被动扳机"
FriendlyNamePlural="高级被动扳机"
BriefSummary="提供 2 次速射"
TinySummary="提供 2 次速射"
LootTooltip="武器部件提供 2 次速射"

[GrimyProgressive_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极被动扳机"
FriendlyNamePlural="终极被动扳机"
BriefSummary="提供 3 次速射"
TinySummary="提供 3 次速射"
LootTooltip="武器部件提供 3 次速射"

[GrimyHighCycle_Bsc X2WeaponUpgradeTemplate]
FriendlyName="高旋枪管"
FriendlyNamePlural="高旋枪管"
BriefSummary="命中 +5%，伤害 +30%，暴击 -100%."
TinySummary="增加命中和伤害但减少暴击"
LootTooltip="武器部件增加命中和伤害但减少暴击"

[GrimyHighCycle_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级高旋枪管"
FriendlyNamePlural="高级高旋枪管"
BriefSummary="命中 +10%，伤害 +35%，暴击 -100%."
TinySummary="增加命中和伤害但减少暴击"
LootTooltip="武器部件增加命中和伤害但减少暴击"

[GrimyHighCycle_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极高旋枪管"
FriendlyNamePlural="终极高旋枪管"
BriefSummary="命中 +15%，伤害 +40%，暴击 -100%."
TinySummary="增加命中和伤害但减少暴击"
LootTooltip="武器部件增加命中和伤害但减少暴击"

[GrimyHighCaliber_Bsc X2WeaponUpgradeTemplate]
FriendlyName="大口径弹药"
FriendlyNamePlural="大口径弹药"
BriefSummary="伤害 +30%，弹药量 -2."
TinySummary="增加伤害减少携弹量"
LootTooltip="武器部件增加伤害减少携弹量"

[GrimyHighCaliber_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级大口径弹药"
FriendlyNamePlural="高级大口径弹药"
BriefSummary="伤害 +35%，弹药量 -2."
TinySummary="增加伤害减少携弹量"
LootTooltip="武器部件增加伤害减少携弹量"

[GrimyHighCaliber_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极大口径弹药"
FriendlyNamePlural="终极大口径弹药"
BriefSummary="伤害 +40%，弹药量 -2."
TinySummary="增加伤害减少携弹量"
LootTooltip="武器部件增加伤害减少携弹量"

[GrimyProcessor_Bsc X2WeaponUpgradeTemplate]
FriendlyName="外部处理器"
FriendlyNamePlural="外部处理器"
BriefSummary="骇客能力和灵能攻击 +5%."
TinySummary="增加骇客能力和灵能攻击"
LootTooltip="武器部件增加骇客能力和灵能攻击"

[GrimyProcessor_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级外部处理器"
FriendlyNamePlural="高级外部处理器"
BriefSummary="骇客能力和灵能攻击 +10%."
TinySummary="增加骇客能力和灵能攻击"
LootTooltip="武器部件增加骇客能力和灵能攻击"

[GrimyProcessor_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极外部处理器"
FriendlyNamePlural="终极外部处理器"
BriefSummary="骇客能力和灵能攻击 +15%."
TinySummary="增加骇客能力和灵能攻击"
LootTooltip="武器部件增加骇客能力和灵能攻击"

[GrimyWildcat_Bsc X2WeaponUpgradeTemplate]
FriendlyName="野猫子弹"
FriendlyNamePlural="野猫子弹"
BriefSummary="暴击伤害 +1"
TinySummary="增加暴击伤害"
LootTooltip="武器部件增加暴击伤害"

[GrimyWildcat_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级野猫子弹"
FriendlyNamePlural="高级野猫子弹"
BriefSummary="暴击伤害 +2"
TinySummary="增加暴击伤害"
LootTooltip="武器部件增加暴击伤害"

[GrimyWildcat_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极野猫子弹"
FriendlyNamePlural="终极野猫子弹"
BriefSummary="暴击伤害 +3"
TinySummary="增加暴击伤害"
LootTooltip="武器部件增加暴击伤害"

[GrimyFrontload_Bsc X2WeaponUpgradeTemplate]
FriendlyName="前负荷弹匝"
FriendlyNamePlural="前负荷弹匝"
BriefSummary="首发射击命中和暴击率 +10%, 然后每次射击都减少 10%。"
TinySummary="提升首发射击命中和暴击率"
LootTooltip="武器部件提升首发命中和暴击率但之后逐次降低。"

[GrimyFrontload_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级前负荷弹匝"
FriendlyNamePlural="高级前负荷弹匝"
BriefSummary="首发射击命中和暴击率 +15%, 然后每次射击都减少 15%。"
TinySummary="提升首发射击命中和暴击率"
LootTooltip="武器部件提升首发命中和暴击率但之后逐次降低。"

[GrimyFrontload_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极前负荷弹匝"
FriendlyNamePlural="终极前负荷弹匝"
BriefSummary="首发射击命中和暴击率 +20%, 然后每次射击都减少 20%。"
TinySummary="提升首发射击命中和暴击率"
LootTooltip="武器部件提升首发命中和暴击率但之后逐次降低。"

[GrimyReserve_Bsc X2WeaponUpgradeTemplate]
FriendlyName="后负荷弹匝"
FriendlyNamePlural="后负荷弹匝"
BriefSummary="弹匝最后一颗子弹命中 +40%，暴击率 +10%。"
TinySummary="提升末发射击命中和暴击率"
LootTooltip="武器部件提升末发命中和暴击率。"

[GrimyReserve_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级后负荷弹匝"
FriendlyNamePlural="高级后负荷弹匝"
BriefSummary="弹匝最后一颗子弹命中 +50%，暴击率 +20%。"
TinySummary="提升末发射击命中和暴击率"
LootTooltip="武器部件提升末发命中和暴击率。"

[GrimyReserve_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极后负荷弹匝"
FriendlyNamePlural="终极后负荷弹匝"
BriefSummary="弹匝最后一颗子弹命中 +60%，暴击率 +30%。"
TinySummary="提升末发射击命中和暴击率"
LootTooltip="武器部件提升末发命中和暴击率。"

[GrimyAmmoSynthesizer_Bsc X2WeaponUpgradeTemplate]
FriendlyName="弹药同步器"
FriendlyNamePlural="弹药同步器"
BriefSummary="每回合自动装填1颗子弹，不需要手动装填。"
TinySummary="子弹生成"
LootTooltip="武器部件会缓慢地生成子弹。"

[GrimyAmmoSynthesizer_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级弹药同步器"
FriendlyNamePlural="高级弹药同步器"
BriefSummary="每回合自动装填1颗子弹，20%的几率会自动装填2颗子弹。不需要手动装填。"
TinySummary="子弹生成"
LootTooltip="武器部件会缓慢地生成子弹。"

[GrimyAmmoSynthesizer_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极弹药同步器"
FriendlyNamePlural="终极弹药同步器"
BriefSummary="每回合自动装填1颗子弹，40%的几率会自动装填2颗子弹。不需要手动装填。"
TinySummary="子弹生成"
LootTooltip="武器部件会缓慢地生成子弹。"

[GrimyAddDragonRounds_Bsc X2WeaponUpgradeTemplate]
FriendlyName="火龙弹匝"
FriendlyNamePlural="火龙弹匝"
BriefSummary="可以使用火龙子弹。 -1 弹匝容量。"
TinySummary="火龙子弹，减少弹匝容量"
LootTooltip="武器部件可以使用火龙子弹。"

[GrimyAddDragonRounds_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级火龙弹匝"
FriendlyNamePlural="高级火龙弹匝"
BriefSummary="可以使用火龙子弹。"
TinySummary="火龙子弹"
LootTooltip="武器部件可以使用火龙子弹。"

[GrimyAddDragonRounds_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极火龙弹匝"
FriendlyNamePlural="终极火龙弹匝"
BriefSummary="可以使用火龙子弹。 +1 弹匝容量。"
TinySummary="火龙子弹，增加弹匝容量"
LootTooltip="武器部件可以使用火龙子弹。"

[GrimyAddVenomRounds_Bsc X2WeaponUpgradeTemplate]
FriendlyName="毒液弹匝"
FriendlyNamePlural="毒液弹匝"
BriefSummary="可以使用毒液子弹。 -1 弹匝容量。"
TinySummary="毒液子弹，减少弹匝容量"
LootTooltip="武器部件可以使用毒液子弹。"

[GrimyAddVenomRounds_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级毒液弹匝"
FriendlyNamePlural="高级毒液弹匝"
BriefSummary="可以使用毒液子弹。"
TinySummary="毒液子弹"
LootTooltip="武器部件可以使用毒液子弹。"

[GrimyAddVenomRounds_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极毒液弹匝"
FriendlyNamePlural="终极毒液弹匝"
BriefSummary="可以使用毒液子弹。 +1 弹匝容量。"
TinySummary="毒液子弹，增加弹匝容量"
LootTooltip="武器部件可以使用毒液子弹。"

[GrimyAddBluescreenRounds_Bsc X2WeaponUpgradeTemplate]
FriendlyName="蓝屏弹匝"
FriendlyNamePlural="蓝屏弹匝"
BriefSummary="可以使用蓝屏子弹。 -1 弹匝容量。"
TinySummary="蓝屏子弹，减少弹匝容量"
LootTooltip="武器部件可以使用蓝屏子弹。"

[GrimyAddBluescreenRounds_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级蓝屏弹匝"
FriendlyNamePlural="高级蓝屏弹匝"
BriefSummary="可以使用蓝屏子弹。"
TinySummary="蓝屏子弹"
LootTooltip="武器部件可以使用蓝屏子弹。"

[GrimyAddBluescreenRounds_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极蓝屏弹匝"
FriendlyNamePlural="终极蓝屏弹匝"
BriefSummary="可以使用蓝屏子弹。 +1 弹匝容量。"
TinySummary="蓝屏子弹，增加弹匝容量"
LootTooltip="武器部件可以使用蓝屏子弹。"

[GrimySentinelScope_Bsc X2WeaponUpgradeTemplate]
FriendlyName="哨兵瞄准器"
FriendlyNamePlural="哨兵瞄准器"
BriefSummary="提供 1 次哨兵监视能力"
TinySummary="提供哨兵监视能力"
LootTooltip="武器部件提供一回合监视状态下开两枪的能力。"

[GrimySentinelScope_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级哨兵瞄准器"
FriendlyNamePlural="高级哨兵瞄准器"
BriefSummary="提供 2 次哨兵监视能力"
TinySummary="提供哨兵监视能力"
LootTooltip="武器部件提供一回合监视状态下开两枪的能力。"

[GrimySentinelScope_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极哨兵瞄准器"
FriendlyNamePlural="终极哨兵瞄准器"
BriefSummary="提供 3 次哨兵监视能力"
TinySummary="提供哨兵监视能力"
LootTooltip="武器部件提供一回合监视状态下开两枪的能力。"

[GrimySentinelOne X2AbilityTemplate]
LocFriendlyName="哨兵监视"
LocHelpText="一回合监视状态下开两枪"

[GrimySentinelTwo X2AbilityTemplate]
LocFriendlyName="高级哨兵监视"
LocHelpText="一回合监视状态下开两枪"

[GrimySentinelThree X2AbilityTemplate]
LocFriendlyName="终极哨兵监视"
LocHelpText="一回合监视状态下开两枪"

[GrimyUndertaker_Bsc X2WeaponUpgradeTemplate]
FriendlyName="敌情感应"
FriendlyNamePlural="敌情感应"
BriefSummary="视野敌人每增加1人，暴击伤害 +1，最高 +3。"
TinySummary="增加暴击伤害"
LootTooltip="武器部件可根据视野敌人数目增加暴击伤害。"

[GrimyUndertaker_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级敌情感应"
FriendlyNamePlural="高级敌情感应"
BriefSummary="视野敌人每增加1人，暴击伤害 +1，最高 +4。"
TinySummary="增加暴击伤害"
LootTooltip="武器部件可根据视野敌人数目增加暴击伤害。"

[GrimyUndertaker_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极敌情感应"
FriendlyNamePlural="终极敌情感应"
BriefSummary="视野敌人每增加1人，暴击伤害 +1，最高 +5。"
TinySummary="增加暴击伤害"
LootTooltip="武器部件可根据视野敌人数目增加暴击伤害。"

[GrimyDuelist_Bsc X2WeaponUpgradeTemplate]
FriendlyName="决斗者必备"
FriendlyNamePlural="决斗者必备"
BriefSummary="我方视野只有 1 敌人，并且可以双方互见情况下，伤害 +25%。"
TinySummary="伤害增加"
LootTooltip="武器部件在 1对1 枪战情况下增加使用者能力。"

[GrimyDuelist_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级决斗者必备"
FriendlyNamePlural="高级决斗者必备"
BriefSummary="我方视野只有 1 敌人，并且可以双方互见情况下，伤害 +30%。"
TinySummary="伤害增加"
LootTooltip="武器部件在 1对1 枪战情况下增加使用者能力。"

[GrimyDuelist_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极决斗者必备"
FriendlyNamePlural="终极决斗者必备"
BriefSummary="我方视野只有 1 敌人，并且可以双方互见情况下，伤害 +35%。"
TinySummary="伤害增加"
LootTooltip="武器部件在 1对1 枪战情况下增加使用者能力。"

[GrimySeigebreakerScope_Bsc X2WeaponUpgradeTemplate]
FriendlyName="突围瞄准镜"
FriendlyNamePlural="突围瞄准镜"
BriefSummary="攻击监视状态敌人时，命中和暴击率 +25%。"
TinySummary="增加命中和暴击率"
LootTooltip="武器部件可以在攻击监视状态敌人时，命中和暴击率。"

[GrimySeigebreakerScope_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级突围瞄准镜"
FriendlyNamePlural="高级突围瞄准镜"
BriefSummary="攻击监视状态敌人时，命中和暴击率 +30%。"
TinySummary="增加命中和暴击率"
LootTooltip="武器部件可以在攻击监视状态敌人时，命中和暴击率。"

[GrimySeigebreakerScope_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极突围瞄准镜"
FriendlyNamePlural="终极突围瞄准镜"
BriefSummary="攻击监视状态敌人时，命中和暴击率 +35%。"
TinySummary="增加命中和暴击率"
LootTooltip="武器部件可以在攻击监视状态敌人时，命中和暴击率。"


[GrimySquadVideo_Bsc X2WeaponUpgradeTemplate]
FriendlyName="队伍视频"
FriendlyNamePlural="队伍视频"
BriefSummary="提供小队视野"
TinySummary="提供小队视野"
LootTooltip="武器部件提供小队视野"

[GrimySquadVideo_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级队伍视频"
FriendlyNamePlural="高级队伍视频"
BriefSummary="提供小队视野和守望"
TinySummary="提供小队视野和守望"
LootTooltip="武器部件提供小队视野和守望"

[GrimySquadVideo_Sup X2WeaponUpgradeTemplate]
FriendlyName="终级队伍视频"
FriendlyNamePlural="终级队伍视频"
BriefSummary="提供小队视野、守望和时刻警惕"
TinySummary="提供小队视野、守望和时刻警惕"
LootTooltip="武器部件提供小队视野、守望和时刻警惕"

[GrimyDoubleTap_Bsc X2WeaponUpgradeTemplate]
FriendlyName="双目标捕捉"
FriendlyNamePlural="双目标捕捉"
BriefSummary="提供连环射击"
TinySummary="提供连环射击"
LootTooltip="武器部件帮助使用者轻松对付多个敌人。"

[GrimyDoubleTap_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级双目标捕捉"
FriendlyNamePlural="高级双目标捕捉"
BriefSummary="提供连环射击和 1 次枪林弹雨"
TinySummary="提供连环射击和 1 次枪林弹雨"
LootTooltip="武器部件帮助使用者轻松对付多个敌人。"

[GrimyDoubleTap_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极双目标捕捉"
FriendlyNamePlural="终极双目标捕捉"
BriefSummary="提供连环射击和 2 次枪林弹雨"
TinySummary="提供连环射击和 2 次枪林弹雨"
LootTooltip="武器部件帮助使用者轻松对付多个敌人。"

[GrimyBeltFeed_Bsc X2WeaponUpgradeTemplate]
FriendlyName="皮带锁扣"
FriendlyNamePlural="皮带锁扣"
BriefSummary="提供 1 次饱和射击"
TinySummary="提供 1 次饱和射击"
LootTooltip="武器部件提供大量火力。"

[GrimyBeltFeed_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级皮带锁扣"
FriendlyNamePlural="高级皮带锁扣"
BriefSummary="提供 2 次饱和射击"
TinySummary="提供 2 次饱和射击"
LootTooltip="武器部件提供大量火力。"

[GrimyBeltFeed_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极皮带锁扣"
FriendlyNamePlural="终极皮带锁扣"
BriefSummary="提供 3 次饱和射击"
TinySummary="提供 3 次饱和射击"
LootTooltip="武器部件提供大量火力。"

[GrimyAntiMaterial_Bsc X2WeaponUpgradeTemplate]
FriendlyName="反物质炮筒"
FriendlyNamePlural="反物质炮筒"
BriefSummary="碎甲，穿甲能力 +1"
TinySummary="增加碎甲，穿甲能力"
LootTooltip="武器部件提供反物质能力。"

[GrimyAntiMaterial_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级反物质炮筒"
FriendlyNamePlural="高级反物质炮筒"
BriefSummary="碎甲，穿甲能力 +2"
TinySummary="增加碎甲，穿甲能力"
LootTooltip="武器部件提供反物质能力。"

[GrimyAntiMaterial_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极反物质炮筒"
FriendlyNamePlural="终极反物质炮筒"
BriefSummary="碎甲，穿甲能力 +3"
TinySummary="增加碎甲，穿甲能力"
LootTooltip="武器部件提供反物质能力。"

[GrimyCustomStock_Bsc X2WeaponUpgradeTemplate]
FriendlyName="定制工具"
FriendlyNamePlural="定制工具"
BriefSummary="无视命中与否 +1 伤害"
TinySummary="增加伤害"
LootTooltip="武器部件极大提高了士兵的持久战力。"

[GrimyCustomStock_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级定制工具"
FriendlyNamePlural="高级定制工具"
BriefSummary="无视命中与否 +2 伤害"
TinySummary="增加伤害"
LootTooltip="武器部件极大提高了士兵的持久战力。"

[GrimyCustomStock_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极定制工具"
FriendlyNamePlural="终极定制工具"
BriefSummary="无视命中与否 +3 伤害"
TinySummary="增加伤害"
LootTooltip="武器部件极大提高了士兵的持久战力。"

[GrimyTwitchTrigger_Bsc X2WeaponUpgradeTemplate]
FriendlyName="猛力扳机"
FriendlyNamePlural="猛力扳机"
BriefSummary="提供 1 次连环杀戮"
TinySummary="提供连环杀戮"
LootTooltip="武器部件提供多目标处理能力。"

[GrimyTwitchTrigger_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级猛力扳机"
FriendlyNamePlural="高级猛力扳机"
BriefSummary="提供 2 次连环杀戮"
TinySummary="提供连环杀戮"
LootTooltip="武器部件提供多目标处理能力。"

[GrimyTwitchTrigger_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极猛力扳机"
FriendlyNamePlural="终极猛力扳机"
BriefSummary="提供 3 次连环杀戮"
TinySummary="提供连环杀戮"
LootTooltip="武器部件提供多目标处理能力。"

[GrimyMaxCaliber_Bsc X2WeaponUpgradeTemplate]
FriendlyName="最大口径弹药"
FriendlyNamePlural="最大口径弹药"
BriefSummary="伤害 +100%但携弹量降为 1。"
TinySummary="伤害增加，携弹量减少"
LootTooltip="武器部件极大提升伤害但是携弹量降为 1。"

[GrimyMaxCaliber_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级最大口径弹药"
FriendlyNamePlural="高级最大口径弹药"
BriefSummary="伤害 +100%但携弹量降为 1，提供 3 点穿甲。"
TinySummary="伤害增加，携弹量减少"
LootTooltip="武器部件极大提升伤害但是携弹量降为 1。"

[GrimyMaxCaliber_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极最大口径弹药"
FriendlyNamePlural="终极最大口径弹药"
BriefSummary="伤害 +100%但携弹量降为 1，提供 3 点穿甲，无法侧面攻击时 +15%暴击。"
TinySummary="伤害增加，携弹量减少"
LootTooltip="武器部件极大提升伤害但是携弹量降为 1。"

;---------------------------------------------
;---    SECONDARY UPGRADES && ABILITIES    ---
;---------------------------------------------

[GrimyDodgePierce_BscPistol X2WeaponUpgradeTemplate]
FriendlyName="智能弹道"
FriendlyNamePlural="智能弹道"
BriefSummary="降低擦伤几率 10%."
TinySummary="降低擦伤几率"
LootTooltip="武器可以增加射击擦伤几率。"

[GrimyDodgePierce_AdvPistol X2WeaponUpgradeTemplate]
FriendlyName="高级智能弹道"
FriendlyNamePlural="高级智能弹道"
BriefSummary="降低擦伤几率 20%."
TinySummary="降低擦伤几率"
LootTooltip="武器可以增加射击擦伤几率。"

[GrimyDodgePierce_SupPistol X2WeaponUpgradeTemplate]
FriendlyName="终极智能弹道"
FriendlyNamePlural="终极智能弹道"
BriefSummary="降低擦伤几率 30%."
TinySummary="降低擦伤几率"
LootTooltip="武器可以增加射击擦伤几率。"

[GrimyRedDot_BscPistol X2WeaponUpgradeTemplate]
FriendlyName="红点瞄准"
FriendlyNamePlural="红点瞄准"
BriefSummary="侧面瞄准增加命中率和暴击率 5%."
TinySummary="侧面瞄准增加命中率和暴击率"
LootTooltip="武器侧面瞄准增加命中率和暴击率"

[GrimyRedDot_AdvPistol X2WeaponUpgradeTemplate]
FriendlyName="高级红点瞄准"
FriendlyNamePlural="高级红点瞄准"
BriefSummary="侧面瞄准增加命中率和暴击率 10%."
TinySummary="侧面瞄准增加命中率和暴击率"
LootTooltip="武器侧面瞄准增加命中率和暴击率"

[GrimyRedDot_SupPistol X2WeaponUpgradeTemplate]
FriendlyName="终级红点瞄准"
FriendlyNamePlural="终级红点瞄准"
BriefSummary="侧面瞄准增加命中率和暴击率 15%."
TinySummary="侧面瞄准增加命中率和暴击率"
LootTooltip="武器侧面瞄准增加命中率和暴击率"

[GrimyScanner_BscPistol X2WeaponUpgradeTemplate]
FriendlyName="人体扫描"
FriendlyNamePlural="人体扫描"
BriefSummary="增加视线范围1格"
TinySummary="增加视线范围"
LootTooltip="武器可以增加视线范围。"

[GrimyScanner_AdvPistol X2WeaponUpgradeTemplate]
FriendlyName="高级人体扫描"
FriendlyNamePlural="高级人体扫描"
BriefSummary="增加视线范围2格"
TinySummary="增加视线范围"
LootTooltip="武器可以增加视线范围。"

[GrimyScanner_SupPistol X2WeaponUpgradeTemplate]
FriendlyName="终极人体扫描"
FriendlyNamePlural="终极人体扫描"
BriefSummary="增加视线范围3格"
TinySummary="增加视线范围"
LootTooltip="武器可以增加视线范围。"

[GrimySuppressor_BscPistol X2WeaponUpgradeTemplate]
FriendlyName="消声器"
FriendlyNamePlural="消声器"
BriefSummary="隐蔽或不在敌人视野内时命中和暴击+15%。"
TinySummary="15% 暗影打击"
LootTooltip="这个武器配件在不可视的状态下提供了额外的命中和暴击。"

[GrimySuppressor_AdvPistol X2WeaponUpgradeTemplate]
FriendlyName="高级消声器"
FriendlyNamePlural="高级消声器"
BriefSummary="隐蔽或不在敌人视野内时命中和暴击+20%。"
TinySummary="20% 暗影打击"
LootTooltip="这个武器配件在不可视的状态下提供了额外的命中和暴击。"

[GrimySuppressor_SupPistol X2WeaponUpgradeTemplate]
FriendlyName="终极消声器"
FriendlyNamePlural="终极消声器"
BriefSummary="隐蔽或不在敌人视野内时命中和暴击+25%。"
TinySummary="25% 暗影打击"
LootTooltip="这个武器配件在不可视的状态下提供了额外的命中和暴击。"

[GrimyWildcat_BscPistol X2WeaponUpgradeTemplate]
FriendlyName="野猫子弹"
FriendlyNamePlural="野猫子弹"
BriefSummary="暴击伤害 +1"
TinySummary="增加暴击伤害"
LootTooltip="武器部件增加暴击伤害"

[GrimyWildcat_AdvPistol X2WeaponUpgradeTemplate]
FriendlyName="高级野猫子弹"
FriendlyNamePlural="高级野猫子弹"
BriefSummary="暴击伤害 +2"
TinySummary="增加暴击伤害"
LootTooltip="武器部件增加暴击伤害"

[GrimyWildcat_SupPistol X2WeaponUpgradeTemplate]
FriendlyName="终极野猫子弹"
FriendlyNamePlural="终极野猫子弹"
BriefSummary="暴击伤害 +3"
TinySummary="增加暴击伤害"
LootTooltip="武器部件增加暴击伤害"

[GrimyWidowmaker_BscPistol X2WeaponUpgradeTemplate]
FriendlyName="寡妇制造者"
FriendlyNamePlural="寡妇制造者"
BriefSummary="提供 1 次对峙"
TinySummary="提供对峙"
LootTooltip="武器部件提供对峙"

[GrimyWidowmaker_AdvPistol X2WeaponUpgradeTemplate]
FriendlyName="高级寡妇制造者"
FriendlyNamePlural="高级寡妇制造者"
BriefSummary="提供 2 次对峙"
TinySummary="提供对峙"
LootTooltip="武器部件提供对峙"

[GrimyWidowmaker_SupPistol X2WeaponUpgradeTemplate]
FriendlyName="终极寡妇制造者"
FriendlyNamePlural="终极寡妇制造者"
BriefSummary="提供 3 次对峙"
TinySummary="提供对峙"
LootTooltip="武器部件提供对峙"

[GrimyLawbringer_BscPistol X2WeaponUpgradeTemplate]
FriendlyName="执法者"
FriendlyNamePlural="执法者"
BriefSummary="提供 1 次多重火力"
TinySummary="提供多重火力"
LootTooltip="武器部件提供多重火力"

[GrimyLawbringer_AdvPistol X2WeaponUpgradeTemplate]
FriendlyName="高级执法者"
FriendlyNamePlural="高级执法者"
BriefSummary="提供 2 次多重火力"
TinySummary="提供多重火力"
LootTooltip="武器部件提供多重火力"

[GrimyLawbringer_SupPistol X2WeaponUpgradeTemplate]
FriendlyName="终极执法者"
FriendlyNamePlural="终极执法者"
BriefSummary="提供 3 次多重火力"
TinySummary="提供多重火力"
LootTooltip="武器部件提供多重火力"

[GrimyHandofLight_BscPistol X2WeaponUpgradeTemplate]
FriendlyName="闪电手"
FriendlyNamePlural="闪电手"
BriefSummary="雷霆之手冷却回合 -1。"
TinySummary="提供雷霆之手"
LootTooltip="武器部件提供雷霆之手"

[GrimyHandofLight_AdvPistol X2WeaponUpgradeTemplate]
FriendlyName="高级闪电手"
FriendlyNamePlural="高级闪电手"
BriefSummary="雷霆之手冷却回合 -1，暴击率 +5%。"
TinySummary="提供雷霆之手"
LootTooltip="武器部件提供雷霆之手"

[GrimyHandofLight_SupPistol X2WeaponUpgradeTemplate]
FriendlyName="终极闪电手"
FriendlyNamePlural="高级闪电手"
BriefSummary="雷霆之手冷却回合 -1，暴击率 +10%。"
TinySummary="提供雷霆之手"
LootTooltip="武器部件提供雷霆之手"

[GrimyWolfsTooth_BscPistol X2WeaponUpgradeTemplate]
FriendlyName="狼牙"
FriendlyNamePlural="狼牙"
BriefSummary="击杀后有 40% 几率得到一个行动点。"
TinySummary="击杀后行动点返还"
LootTooltip="武器部件提供击杀后有几率得到行动点的能力。"

[GrimyWolfsTooth_AdvPistol X2WeaponUpgradeTemplate]
FriendlyName="高级狼牙"
FriendlyNamePlural="高级狼牙"
BriefSummary="击杀后有 50% 几率得到一个行动点和提升 5% 的暴击率。"
TinySummary="击杀后行动点返还"
LootTooltip="武器部件提供击杀后有几率得到行动点的能力。"

[GrimyWolfsTooth_SupPistol X2WeaponUpgradeTemplate]
FriendlyName="终级狼牙"
FriendlyNamePlural="终级狼牙"
BriefSummary="击杀后有 60% 几率得到一个行动点和提升 10% 的暴击率。"
TinySummary="击杀后行动点返还"
LootTooltip="武器部件提供击杀后有几率得到行动点的能力。"

[GrimyThunderAndLightning_BscPistol X2WeaponUpgradeTemplate]
FriendlyName="雷电"
FriendlyNamePlural="雷电"
BriefSummary="手枪伤害 +1, 狙击枪伤害 +80%, 但是无法装填弹药。"
TinySummary="伤害增加但无法装填弹药"
LootTooltip="武器部件提供增加伤害能力但是禁止装填弹药。"

[GrimyThunderAndLightning_AdvPistol X2WeaponUpgradeTemplate]
FriendlyName="高级雷电"
FriendlyNamePlural="高级雷电"
BriefSummary="手枪伤害 +1, 狙击枪伤害 +90%, 但是无法装填弹药。"
TinySummary="伤害增加但无法装填弹药"
LootTooltip="武器部件提供增加伤害能力但是禁止装填弹药。"

[GrimyThunderAndLightning_SupPistol X2WeaponUpgradeTemplate]
FriendlyName="终极雷电"
FriendlyNamePlural="终极雷电"
BriefSummary="手枪伤害 +1, 狙击枪伤害 +100%, 但是无法装填弹药。"
TinySummary="伤害增加但无法装填弹药"
LootTooltip="武器部件提供增加伤害能力但是禁止装填弹药。"

[GrimySwordGrip_BscSword X2WeaponUpgradeTemplate]
FriendlyName="配枪皮套"
FriendlyNamePlural="配枪皮套"
BriefSummary="回合开始时有额外的行动点。移动力 -6."
TinySummary="增加行动点，减少移动力"
LootTooltip="武器部件能更灵活地行动。"

[GrimySwordGrip_AdvSword X2WeaponUpgradeTemplate]
FriendlyName="高级配枪皮套"
FriendlyNamePlural="高级配枪皮套"
BriefSummary="回合开始时有额外的行动点。移动力 -5."
TinySummary="增加行动点，减少移动力"
LootTooltip="武器部件能更灵活地行动。"

[GrimySwordGrip_SupSword X2WeaponUpgradeTemplate]
FriendlyName="终极配枪皮套"
FriendlyNamePlural="终极配枪皮套"
BriefSummary="回合开始时有额外的行动点。移动力 -4."
TinySummary="增加行动点，减少移动力"
LootTooltip="武器部件能更灵活地行动。"

[GrimyFlourish_BscSword X2WeaponUpgradeTemplate]
FriendlyName="刀锋之舞"
FriendlyNamePlural="刀锋之舞"
BriefSummary="躲避成功率 +10%"
TinySummary="擦伤可能性降低"
LootTooltip="武器部件减少擦伤"

[GrimyFlourish_AdvSword X2WeaponUpgradeTemplate]
FriendlyName="高级刀锋之舞"
FriendlyNamePlural="高级刀锋之舞"
BriefSummary="躲避成功率 +20%"
TinySummary="擦伤可能性降低"
LootTooltip="武器部件减少擦伤"

[GrimyFlourish_SupSword X2WeaponUpgradeTemplate]
FriendlyName="终极刀锋之舞"
FriendlyNamePlural="终极刀锋之舞"
BriefSummary="躲避成功率 +30%"
TinySummary="擦伤可能性降低"
LootTooltip="武器部件减少擦伤"

[GrimySerrated_BscSword X2WeaponUpgradeTemplate]
FriendlyName="锯齿刀锋"
FriendlyNamePlural="锯齿刀锋"
BriefSummary="+10% 暴击率，+1 暴击伤害。"
TinySummary="增加暴击率和暴击伤害"
LootTooltip="武器部件增加暴击率和暴击伤害。"

[GrimySerrated_AdvSword X2WeaponUpgradeTemplate]
FriendlyName="高级锯齿刀锋"
FriendlyNamePlural="高级锯齿刀锋"
BriefSummary="+20% 暴击率，+1 暴击伤害。"
TinySummary="增加暴击率和暴击伤害"
LootTooltip="武器部件增加暴击率和暴击伤害。"

[GrimySerrated_SupSword X2WeaponUpgradeTemplate]
FriendlyName="终极锯齿刀锋"
FriendlyNamePlural="终极锯齿刀锋"
BriefSummary="+30% 暴击率，+1 暴击伤害。"
TinySummary="增加暴击率和暴击伤害"
LootTooltip="武器部件增加暴击率和暴击伤害。"

[GrimyLightweight_BscSword X2WeaponUpgradeTemplate]
FriendlyName="轻量级刀锋"
FriendlyNamePlural="轻量级刀锋"
BriefSummary="移动力 +1."
TinySummary="增加移动力"
LootTooltip="武器部件增加移动力。"

[GrimyLightweight_AdvSword X2WeaponUpgradeTemplate]
FriendlyName="高级轻量级刀锋"
FriendlyNamePlural="高级轻量级刀锋"
BriefSummary="移动力 +2."
TinySummary="增加移动力"
LootTooltip="武器部件增加移动力。"

[GrimyLightweight_SupSword X2WeaponUpgradeTemplate]
FriendlyName="终极轻量级刀锋"
FriendlyNamePlural="终极轻量级刀锋"
BriefSummary="移动力 +3."
TinySummary="增加移动力"
LootTooltip="武器部件增加移动力。"

[GrimyVibroblade_BscSword X2WeaponUpgradeTemplate]
FriendlyName="脉冲刀锋"
FriendlyNamePlural="脉冲刀锋"
BriefSummary="破甲能力 +1."
TinySummary="增加破甲能力"
LootTooltip="武器部件增加破甲能力。"

[GrimyVibroblade_AdvSword X2WeaponUpgradeTemplate]
FriendlyName="高级脉冲刀锋"
FriendlyNamePlural="脉冲刀锋"
BriefSummary="破甲能力 +2."
TinySummary="增加破甲能力"
LootTooltip="武器部件增加破甲能力。"

[GrimyVibroblade_SupSword X2WeaponUpgradeTemplate]
FriendlyName="终极脉冲刀锋"
FriendlyNamePlural="脉冲刀锋"
BriefSummary="破甲能力 +3."
TinySummary="增加破甲能力"
LootTooltip="武器部件增加破甲能力。"

[GrimyMomentum_BscSword X2WeaponUpgradeTemplate]
FriendlyName="动力"
FriendlyNamePlural="动力"
BriefSummary="攻击10格外敌人时暴击伤害 +1，暴击率 +30%。"
TinySummary="增加冲刺后暴击几率和伤害"
LootTooltip="武器部件增加冲刺后暴击几率和伤害"

[GrimyMomentum_AdvSword X2WeaponUpgradeTemplate]
FriendlyName="高级动力"
FriendlyNamePlural="高级动力"
BriefSummary="攻击10格外敌人时暴击伤害 +1，暴击率 +45%。"
TinySummary="增加冲刺后暴击几率和伤害"
LootTooltip="武器部件增加冲刺后暴击几率和伤害"

[GrimyMomentum_SupSword X2WeaponUpgradeTemplate]
FriendlyName="终极动力"
FriendlyNamePlural="终极动力"
BriefSummary="攻击10格外敌人时暴击伤害 +1，暴击率 +60%。"
TinySummary="增加冲刺后暴击几率和伤害"
LootTooltip="武器部件增加冲刺后暴击几率和伤害"

[GrimyParrying_BscSword X2WeaponUpgradeTemplate]
FriendlyName="格挡之刃"
FriendlyNamePlural="格挡之刃"
BriefSummary="近战所受伤害 -4."
TinySummary="降低近战所受伤害"
LootTooltip="武器部件降低近战所受伤害"

[GrimyParrying_AdvSword X2WeaponUpgradeTemplate]
FriendlyName="高级格挡之刃"
FriendlyNamePlural="高级格挡之刃"
BriefSummary="近战所受伤害 -5."
TinySummary="降低近战所受伤害"
LootTooltip="武器部件降低近战所受伤害"

[GrimyParrying_SupSword X2WeaponUpgradeTemplate]
FriendlyName="终极格挡之刃"
FriendlyNamePlural="终极格挡之刃"
BriefSummary="近战所受伤害 -6."
TinySummary="降低近战所受伤害"
LootTooltip="武器部件降低近战所受伤害"

[GrimyInquisition_BscSword X2WeaponUpgradeTemplate]
FriendlyName="黑暗审判"
FriendlyNamePlural="黑暗审判"
BriefSummary="隐蔽状态下近战伤害 +80%"
TinySummary="提升隐蔽状态下近战伤害"
LootTooltip="武器部件提升隐蔽状态下近战伤害"

[GrimyInquisition_AdvSword X2WeaponUpgradeTemplate]
FriendlyName="高级黑暗审判"
FriendlyNamePlural="高级黑暗审判"
BriefSummary="隐蔽状态下近战伤害 +90%"
TinySummary="提升隐蔽状态下近战伤害"
LootTooltip="武器部件提升隐蔽状态下近战伤害"

[GrimyInquisition_SupSword X2WeaponUpgradeTemplate]
FriendlyName="终极黑暗审判"
FriendlyNamePlural="终极黑暗审判"
BriefSummary="隐蔽状态下近战伤害 +100%"
TinySummary="提升隐蔽状态下近战伤害"
LootTooltip="武器部件提升隐蔽状态下近战伤害"

[GrimyLongCrusade_BscSword X2AbilityTemplate]
LocFriendlyName="十字军冲锋"
LocHelpText="每次冲刺获得护甲值 +2，持续 2 回合。"

[GrimyLongCrusade_AdvSword X2AbilityTemplate]
LocFriendlyName="高级十字军冲锋"
LocHelpText="每次冲刺获得护甲值 +2，持续 3 回合。"

[GrimyLongCrusade_SupSword X2AbilityTemplate]
LocFriendlyName="终极十字军冲锋"
LocHelpText="每次冲刺获得护甲值 +2，持续 4 回合。"

[GrimyLongCrusade_BscSword X2WeaponUpgradeTemplate]
FriendlyName="十字军冲锋"
FriendlyNamePlural="十字军冲锋"
BriefSummary="每次冲刺获得护甲值 +2，持续 3 回合。"
TinySummary="近战护甲值提升"
LootTooltip="武器部件使每次冲刺获得护甲值。"

[GrimyLongCrusade_AdvSword X2WeaponUpgradeTemplate]
FriendlyName="高级十字军冲锋"
FriendlyNamePlural="高级十字军冲锋"
BriefSummary="每次冲刺获得护甲值 +2，持续 4 回合。"
TinySummary="近战护甲值提升"
LootTooltip="武器部件使每次冲刺获得护甲值。"

[GrimyLongCrusade_SupSword X2WeaponUpgradeTemplate]
FriendlyName="终极十字军冲锋"
FriendlyNamePlural="终极十字军冲锋"
BriefSummary="每次冲刺获得护甲值 +2，持续 5 回合。"
TinySummary="近战护甲值提升"
LootTooltip="武器部件使每次冲刺获得护甲值。"

[GrimyBigGameHunter_BscSword X2WeaponUpgradeTemplate]
FriendlyName="猎人本色"
FriendlyNamePlural="猎人本色"
BriefSummary="非侧面攻击提升暴击率 30%，暴击伤害 +1。"
TinySummary="提升暴击率和暴击伤害"
LootTooltip="武器部件提升非侧面攻击暴击率和暴击伤害。"

[GrimyBigGameHunter_AdvSword X2WeaponUpgradeTemplate]
FriendlyName="高级猎人本色"
FriendlyNamePlural="高级猎人本色"
BriefSummary="非侧面攻击提升暴击率 45%，暴击伤害 +1。"
TinySummary="提升暴击率和暴击伤害"
LootTooltip="武器部件提升非侧面攻击暴击率和暴击伤害。"

[GrimyBigGameHunter_SupSword X2WeaponUpgradeTemplate]
FriendlyName="终极猎人本色"
FriendlyNamePlural="终极猎人本色"
BriefSummary="非侧面攻击提升暴击率 60%，暴击伤害 +1。"
TinySummary="提升暴击率和暴击伤害"
LootTooltip="武器部件提升非侧面攻击暴击率和暴击伤害。"

[GrimyBrokenBlade_BscSword X2WeaponUpgradeTemplate]
FriendlyName="断剑"
FriendlyNamePlural="断剑"
BriefSummary="霰弹枪伤害 +30%，剑伤害 -30%。"
TinySummary="提升霰弹枪伤害，减少剑伤害"
LootTooltip="武器部件提升霰弹枪伤害，减少剑伤害。"

[GrimyBrokenBlade_AdvSword X2WeaponUpgradeTemplate]
FriendlyName="高级断剑"
FriendlyNamePlural="高级断剑"
BriefSummary="霰弹枪伤害 +35%，剑伤害 -35%。"
TinySummary="提升霰弹枪伤害，减少剑伤害"
LootTooltip="武器部件提升霰弹枪伤害，减少剑伤害。"

[GrimyBrokenBlade_SupSword X2WeaponUpgradeTemplate]
FriendlyName="终极断剑"
FriendlyNamePlural="终极断剑"
BriefSummary="霰弹枪伤害 +40%，剑伤害 -40%。"
TinySummary="提升霰弹枪伤害，减少剑伤害"
LootTooltip="武器部件提升霰弹枪伤害，减少剑伤害。"

[GrimyReaperOne X2AbilityTemplate]
LocFriendlyName="死亡之手"
LocHelpText="死神技能每次击杀提升伤害 2。"

[GrimyReaperTwo X2AbilityTemplate]
LocFriendlyName="高级死亡之手"
LocHelpText="死神技能每次击杀提升伤害 2，最低伤害 +1。"

[GrimyReaperThree X2AbilityTemplate]
LocFriendlyName="终级死亡之手"
LocHelpText="死神技能每次击杀提升伤害 2，最低伤害 +2。"

[GrimyDeathsHand_BscSword X2WeaponUpgradeTemplate]
FriendlyName="死亡之手"
FriendlyNamePlural="死亡之手"
BriefSummary="死神技能每次击杀提升伤害 2。"
TinySummary="死神技能增强"
LootTooltip="武器部件使死神技能更加致命。"

[GrimyDeathsHand_AdvSword X2WeaponUpgradeTemplate]
FriendlyName="高级死亡之手"
FriendlyNamePlural="高级死亡之手"
BriefSummary="死神技能每次击杀提升伤害 2，最低伤害 +1。"
TinySummary="死神技能增强"
LootTooltip="武器部件使死神技能更加致命。"

[GrimyDeathsHand_SupSword X2WeaponUpgradeTemplate]
FriendlyName="终级死亡之手"
FriendlyNamePlural="终级死亡之手"
BriefSummary="死神技能每次击杀提升伤害 2，最低伤害 +2。"
TinySummary="死神技能增强"
LootTooltip="武器部件使死神技能更加致命。"

[GrimyRapidSlashOne X2AbilityTemplate]
LocFriendlyName="快速冲刺"
LocHelpText="冲刺后得到 1 行动点。"

[GrimyRapidSlashTwo X2AbilityTemplate]
LocFriendlyName="高级快速冲刺"
LocHelpText="冲刺后得到 1 行动点。"

[GrimyRapidSlashThree X2AbilityTemplate]
LocFriendlyName="终极快速冲刺"
LocHelpText="冲刺后得到 1 行动点。"

[GrimyRazorsEdge_BscSword X2WeaponUpgradeTemplate]
FriendlyName="空手入白刃"
FriendlyNamePlural="空手入白刃"
BriefSummary="可以使用 1 次快速冲刺。"
TinySummary="可以使用快速冲刺。"
LootTooltip="武器部件装备后冲刺后得到 1 行动点。"

[GrimyRazorsEdge_AdvSword X2WeaponUpgradeTemplate]
FriendlyName="高级空手入白刃"
FriendlyNamePlural="高级空手入白刃"
BriefSummary="可以使用 2 次快速冲刺。"
TinySummary="可以使用快速冲刺。"
LootTooltip="武器部件装备后冲刺后得到 1 行动点。"

[GrimyRazorsEdge_SupSword X2WeaponUpgradeTemplate]
FriendlyName="终极空手入白刃"
FriendlyNamePlural="终极空手入白刃"
BriefSummary="可以使用 3 次快速冲刺。"
TinySummary="可以使用快速冲刺。"
LootTooltip="武器部件装备后冲刺后得到 1 行动点。"

[GrimyConviction X2AbilityTemplate]
LocFriendlyName="猜忌原罪"
LocHelpText="斩杀一个不满血的敌人但没有杀死将获得一个行动点。"

[GrimyConviction_BscSword X2WeaponUpgradeTemplate]
FriendlyName="猜忌原罪"
FriendlyNamePlural="猜忌原罪"
BriefSummary="斩杀一个不满血的敌人但没有杀死将获得一个行动点。"
TinySummary="伤敌后返还行动点"
LootTooltip="武器部件伤敌后返还行动点。"

[GrimyConviction_AdvSword X2WeaponUpgradeTemplate]
FriendlyName="高级猜忌原罪"
FriendlyNamePlural="高级猜忌原罪"
BriefSummary="斩杀一个不满血的敌人但没有杀死将获得一个行动点，命中 +5%。"
TinySummary="伤敌后返还行动点"
LootTooltip="武器部件伤敌后返还行动点。"

[GrimyConviction_SupSword X2WeaponUpgradeTemplate]
FriendlyName="终级猜忌原罪"
FriendlyNamePlural="终级猜忌原罪"
BriefSummary="斩杀一个不满血的敌人但没有杀死将获得一个行动点，命中 +10%。"
TinySummary="伤敌后返还行动点"
LootTooltip="武器部件伤敌后返还行动点。"

[GrimyShadowlace_BscSword X2WeaponUpgradeTemplate]
FriendlyName="暗影步调"
FriendlyNamePlural="暗影步调"
BriefSummary="增加 1 次隐蔽技能使用"
TinySummary="增加隐蔽技能使用次数"
LootTooltip="武器部件增加隐蔽技能使用次数。"

[GrimyShadowlace_AdvSword X2WeaponUpgradeTemplate]
FriendlyName="暗影步调"
FriendlyNamePlural="暗影步调"
BriefSummary="增加 2 次隐蔽技能使用"
TinySummary="增加隐蔽技能使用次数"
LootTooltip="武器部件增加隐蔽技能使用次数。"

[GrimyShadowlace_SupSword X2WeaponUpgradeTemplate]
FriendlyName="暗影步调"
FriendlyNamePlural="暗影步调"
BriefSummary="增加 3 次隐蔽技能使用"
TinySummary="增加隐蔽技能使用次数"
LootTooltip="武器部件增加隐蔽技能使用次数。"

[GrimyBlindingProtocolOne X2AbilityTemplate]
LocFriendlyName="致盲协议"
LocHelpText="降低目标命中 50% 持续 1 回合。"
LocFlyOverText="致盲"

[GrimyBlindingProtocolTwo X2AbilityTemplate]
LocFriendlyName="致盲协议"
LocHelpText="降低目标命中 50% 持续 1 回合。"
LocFlyOverText="致盲"

[GrimyBlindingProtocolThree X2AbilityTemplate]
LocFriendlyName="致盲协议"
LocHelpText="降低目标命中 50% 持续 1 回合。"
LocFlyOverText="致盲"

[GrimyTripwireProtocolOne X2AbilityTemplate]
LocFriendlyName="陷阱协议"
LocHelpText="降低目标移动力 4 持续 1 回合。"
LocFlyOverText="缓慢"

[GrimyTripwireProtocolTwo X2AbilityTemplate]
LocFriendlyName="陷阱协议"
LocHelpText="降低目标移动力 4 持续 1 回合。"
LocFlyOverText="缓慢"

[GrimyTripwireProtocolThree X2AbilityTemplate]
LocFriendlyName="陷阱协议"
LocHelpText="降低目标移动力 4 持续 1 回合。"
LocFlyOverText="缓慢"

[GrimyChargeRevivalOne X2AbilityTemplate]
LocFriendlyName="复活协议"
LocHelpText="派小精灵到友军身边并去除一切负面精神状态效果：混乱、眩晕、恐慌、失去意识。"
LocFlyOverText="精神恢复"

[GrimyChargeRevivalTwo X2AbilityTemplate]
LocFriendlyName="复活协议"
LocHelpText="派小精灵到友军身边并去除一切负面精神状态效果：混乱、眩晕、恐慌、失去意识。"
LocFlyOverText="精神恢复"

[GrimyChargeRevivalThree X2AbilityTemplate]
LocFriendlyName="复活协议"
LocHelpText="派小精灵到友军身边并去除一切负面精神状态效果：混乱、眩晕、恐慌、失去意识。"
LocFlyOverText="精神恢复"

[GrimyChargeOverrideOne X2AbilityTemplate]
LocFriendlyName="破解协议"
LocHelpText="目标友军士兵能完全免疫接下来的 1 次攻击。"
LocFlyOverText="破解"

[GrimyChargeOverrideTwo X2AbilityTemplate]
LocFriendlyName="破解协议"
LocHelpText="目标友军士兵能完全免疫接下来的 1 次攻击。"
LocFlyOverText="破解"

[GrimyChargeOverrideThree X2AbilityTemplate]
LocFriendlyName="破解协议"
LocHelpText="目标友军士兵能完全免疫接下来的 1 次攻击。"
LocFlyOverText="破解"

[GrimyShieldProtocolOne X2AbilityTemplate]
LocFriendlyName="护盾协议"
LocHelpText="给予一个友军 3 点护盾值，持续 3 回合。"

[GrimyShieldProtocolTwo X2AbilityTemplate]
LocFriendlyName="护盾协议"
LocHelpText="给予一个友军 4 点护盾值，持续 3 回合。"

[GrimyShieldProtocolThree X2AbilityTemplate]
LocFriendlyName="护盾协议"
LocHelpText="给予一个友军 5 点护盾值，持续 3 回合。"

[GrimyChargeDistortionOne X2AbilityTemplate]
LocFriendlyName="扭曲协议"
LocHelpText="让目标恐慌。"

[GrimyChargeDistortionTwo X2AbilityTemplate]
LocFriendlyName="扭曲协议"
LocHelpText="让目标恐慌。"

[GrimyChargeDistortionThree X2AbilityTemplate]
LocFriendlyName="扭曲协议"
LocHelpText="让目标恐慌。"

[GrimyTargetingProtocolOne X2AbilityTemplate]
LocFriendlyName="校准协议"
LocHelpText="给予友军 +10% 命中和暴击率。"
LocFlyOverText="校准"

[GrimyTargetingProtocolTwo X2AbilityTemplate]
LocFriendlyName="校准协议"
LocHelpText="给予友军 +15% 命中和暴击率。"
LocFlyOverText="校准II"

[GrimyTargetingProtocolThree X2AbilityTemplate]
LocFriendlyName="校准协议"
LocHelpText="给予友军 +20% 命中和暴击率。"
LocFlyOverText="校准III"

[GrimyChargeMascotOne X2AbilityTemplate]
LocFriendlyName="吉祥物协议"
LocHelpText="给予友军一个行动点。"

[GrimyChargeMascotTwo X2AbilityTemplate]
LocFriendlyName="吉祥物协议"
LocHelpText="给予友军一个行动点。"

[GrimyChargeMascotThree X2AbilityTemplate]
LocFriendlyName="吉祥物协议"
LocHelpText="给予友军一个行动点。"

[GrimyChargeAegisOne X2AbilityTemplate]
LocFriendlyName="雅典娜之盾协议"
LocHelpText="给予附近友军 6 点护盾值，持续 4 回合。"

[GrimyChargeAegisTwo X2AbilityTemplate]
LocFriendlyName="雅典娜之盾协议"
LocHelpText="给予附近友军 6 点护盾值，持续 4 回合。"

[GrimyChargeAegisThree X2AbilityTemplate]
LocFriendlyName="雅典娜之盾协议"
LocHelpText="给予附近友军 6 点护盾值，持续 4 回合。"

[GrimySquadTargetingOne X2AbilityTemplate]
LocFriendlyName="共享校准协议"
LocHelpText="给予附近友军 15% 命中和暴击率，持续 1 回合。"

[GrimySquadTargetingTwo X2AbilityTemplate]
LocFriendlyName="共享校准协议"
LocHelpText="给予附近友军 15% 命中和暴击率，持续 1 回合。"

[GrimySquadTargetingThree X2AbilityTemplate]
LocFriendlyName="共享校准协议"
LocHelpText="给予附近友军 15% 命中和暴击率，持续 1 回合。"

[GrimyTrojan_BscGremlin X2WeaponUpgradeTemplate]
FriendlyName="木马协议"
FriendlyNamePlural="木马协议"
BriefSummary="骇客能力 +5。"
TinySummary="提升骇客能力"
LootTooltip="武器部件提升骇客能力"

[GrimyTrojan_AdvGremlin X2WeaponUpgradeTemplate]
FriendlyName="高级木马协议"
FriendlyNamePlural="高级木马协议"
BriefSummary="骇客能力 +10。"
TinySummary="提升骇客能力"
LootTooltip="武器部件提升骇客能力"

[GrimyTrojan_SupGremlin X2WeaponUpgradeTemplate]
FriendlyName="终极木马协议"
FriendlyNamePlural="终极木马协议"
BriefSummary="骇客能力 +15。"
TinySummary="提升骇客能力"
LootTooltip="武器部件提升骇客能力"

[GrimyShock_BscGremlin X2WeaponUpgradeTemplate]
FriendlyName="充电协议"
FriendlyNamePlural="充电协议"
BriefSummary="战争协议使用次数 +1。"
TinySummary="提升战争协议使用次数"
LootTooltip="武器部件提升战争协议使用次数。"

[GrimyShock_AdvGremlin X2WeaponUpgradeTemplate]
FriendlyName="高级充电协议"
FriendlyNamePlural="高级充电协议"
BriefSummary="战争协议使用次数 +2。"
TinySummary="提升战争协议使用次数"
LootTooltip="武器部件提升战争协议使用次数。"

[GrimyShock_SupGremlin X2WeaponUpgradeTemplate]
FriendlyName="终极充电协议"
FriendlyNamePlural="终极充电协议"
BriefSummary="战争协议使用次数 +3。"
TinySummary="提升战争协议使用次数"
LootTooltip="武器部件提升战争协议使用次数。"

[GrimyBlindingProtocol_BscGremlin X2WeaponUpgradeTemplate]
FriendlyName="致盲协议"
FriendlyNamePlural="致盲协议"
BriefSummary="致盲协议使用次数 +1 （降低目标命中 50% 持续 1 回合）。"
TinySummary="提升致盲协议使用次数"
LootTooltip="武器部件提升致盲协议使用次数。"

[GrimyBlindingProtocol_AdvGremlin X2WeaponUpgradeTemplate]
FriendlyName="高级致盲协议"
FriendlyNamePlural="高级致盲协议"
BriefSummary="致盲协议使用次数 +2 （降低目标命中 50% 持续 1 回合）。"
TinySummary="提升致盲协议使用次数"
LootTooltip="武器部件提升致盲协议使用次数。"

[GrimyBlindingProtocol_SupGremlin X2WeaponUpgradeTemplate]
FriendlyName="终极致盲协议"
FriendlyNamePlural="终极致盲协议"
BriefSummary="致盲协议使用次数 +3 （降低目标命中 50% 持续 1 回合）。"
TinySummary="提升致盲协议使用次数"
LootTooltip="武器部件提升致盲协议使用次数。"

[GrimyTripwireProtocol_BscGremlin X2WeaponUpgradeTemplate]
FriendlyName="陷阱协议"
FriendlyNamePlural="陷阱协议"
BriefSummary="陷阱协议使用次数 +1（降低目标移动力 4 持续 1 回合）。"
TinySummary="提升陷阱协议使用次数"
LootTooltip="武器部件提升陷阱协议使用次数。"

[GrimyTripwireProtocol_AdvGremlin X2WeaponUpgradeTemplate]
FriendlyName="高级陷阱协议"
FriendlyNamePlural="高级陷阱协议"
BriefSummary="陷阱协议使用次数 +2（降低目标移动力 4 持续 1 回合）。"
TinySummary="提升陷阱协议使用次数"
LootTooltip="武器部件提升陷阱协议使用次数。"

[GrimyTripwireProtocol_SupGremlin X2WeaponUpgradeTemplate]
FriendlyName="终极陷阱协议"
FriendlyNamePlural="终极陷阱协议"
BriefSummary="陷阱协议使用次数 +3（降低目标移动力 4 持续 1 回合）。"
TinySummary="提升陷阱协议使用次数"
LootTooltip="武器部件提升陷阱协议使用次数。"

[GrimySuperCapacitors_BscGremlin X2WeaponUpgradeTemplate]
FriendlyName="超导容器"
FriendlyNamePlural="超导容器"
BriefSummary="小精灵伤害 +1"
TinySummary="提升小精灵伤害"
LootTooltip="武器部件提升小精灵伤害"

[GrimySuperCapacitors_AdvGremlin X2WeaponUpgradeTemplate]
FriendlyName="高级超导容器"
FriendlyNamePlural="高级超导容器"
BriefSummary="小精灵伤害 +2"
TinySummary="提升小精灵伤害"
LootTooltip="武器部件提升小精灵伤害"

[GrimySuperCapacitors_SupGremlin X2WeaponUpgradeTemplate]
FriendlyName="终极超导容器"
FriendlyNamePlural="终极超导容器"
BriefSummary="小精灵伤害 +3"
TinySummary="提升小精灵伤害"
LootTooltip="武器部件提升小精灵伤害"

[GrimyRevival_BscGremlin X2WeaponUpgradeTemplate]
FriendlyName="制裁协议"
FriendlyNamePlural="制裁协议"
BriefSummary="复活协议使用次数 +1，需要有复活协议技能。"
TinySummary="提升复活协议使用次数"
LootTooltip="武器部件提升复活协议使用次数。"

[GrimyRevival_AdvGremlin X2WeaponUpgradeTemplate]
FriendlyName="高级制裁协议"
FriendlyNamePlural="高级制裁协议"
BriefSummary="复活协议使用次数 +2，需要有复活协议技能。"
TinySummary="提升复活协议使用次数"
LootTooltip="武器部件提升复活协议使用次数。"

[GrimyRevival_SupGremlin X2WeaponUpgradeTemplate]
FriendlyName="终极制裁协议"
FriendlyNamePlural="终极制裁协议"
BriefSummary="复活协议使用次数 +3，需要有复活协议技能。"
TinySummary="提升复活协议使用次数"
LootTooltip="武器部件提升复活协议使用次数。"

[GrimyScanning_BscGremlin X2WeaponUpgradeTemplate]
FriendlyName="卫星联机"
FriendlyNamePlural="卫星联机"
BriefSummary="扫描协议使用次数 +1，需要有扫描协议技能。"
TinySummary="提升扫描协议使用次数"
LootTooltip="武器部件提升扫描协议使用次数。"

[GrimyScanning_AdvGremlin X2WeaponUpgradeTemplate]
FriendlyName="高级卫星联机"
FriendlyNamePlural="高级卫星联机"
BriefSummary="扫描协议使用次数 +2，需要有扫描协议技能。"
TinySummary="提升扫描协议使用次数"
LootTooltip="武器部件提升扫描协议使用次数。"

[GrimyScanning_SupGremlin X2WeaponUpgradeTemplate]
FriendlyName="终极卫星联机"
FriendlyNamePlural="终极卫星联机"
BriefSummary="扫描协议使用次数 +3，需要有扫描协议技能。"
TinySummary="提升扫描协议使用次数"
LootTooltip="武器部件提升扫描协议使用次数。"

[GrimyShieldProtocol_BscGremlin X2WeaponUpgradeTemplate]
FriendlyName="护盾协议"
FriendlyNamePlural="护盾协议"
BriefSummary="援助协议提供 3 点护盾值，持续 3 回合。"
TinySummary="援助协议提供护盾值"
LootTooltip="武器部件使援助协议提供护盾值。"

[GrimyShieldProtocol_AdvGremlin X2WeaponUpgradeTemplate]
FriendlyName="高级护盾协议"
FriendlyNamePlural="高级护盾协议"
BriefSummary="援助协议提供 4 点护盾值，持续 3 回合。"
TinySummary="援助协议提供护盾值"
LootTooltip="武器部件使援助协议提供护盾值。"

[GrimyShieldProtocol_SupGremlin X2WeaponUpgradeTemplate]
FriendlyName="终极护盾协议"
FriendlyNamePlural="终极护盾协议"
BriefSummary="援助协议提供 5 点护盾值，持续 3 回合。"
TinySummary="援助协议提供护盾值"
LootTooltip="武器部件使援助协议提供护盾值。"

[GrimyOverride_BscGremlin X2WeaponUpgradeTemplate]
FriendlyName="破解协议"
FriendlyNamePlural="破解协议"
BriefSummary="破解协议使用次数 +1 （目标友军士兵能完全免疫接下来的 1 次攻击）。"
TinySummary="提升破解协议使用次数"
LootTooltip="武器部件能使小精灵保护士兵免疫敌方攻击。"

[GrimyOverride_AdvGremlin X2WeaponUpgradeTemplate]
FriendlyName="高级破解协议"
FriendlyNamePlural="高级破解协议"
BriefSummary="破解协议使用次数 +2 （目标友军士兵能完全免疫接下来的 1 次攻击）。"
TinySummary="提升破解协议使用次数"
LootTooltip="武器部件能使小精灵保护士兵免疫敌方攻击。"

[GrimyOverride_SupGremlin X2WeaponUpgradeTemplate]
FriendlyName="终极破解协议"
FriendlyNamePlural="终极破解协议"
BriefSummary="破解协议使用次数 +3 （目标友军士兵能完全免疫接下来的 1 次攻击）。"
TinySummary="提升破解协议使用次数"
LootTooltip="武器部件能使小精灵保护士兵免疫敌方攻击。"

[GrimyDistortion_BscGremlin X2WeaponUpgradeTemplate]
FriendlyName="扭曲协议"
FriendlyNamePlural="扭曲协议"
BriefSummary="扭曲协议使用次数 +1 （让目标恐慌）。"
TinySummary="提升扭曲协议使用次数"
LootTooltip="武器部件能使小精灵让目标恐慌。"

[GrimyDistortion_AdvGremlin X2WeaponUpgradeTemplate]
FriendlyName="高级扭曲协议"
FriendlyNamePlural="高级扭曲协议"
BriefSummary="扭曲协议使用次数 +2 （让目标恐慌）。"
TinySummary="提升扭曲协议使用次数"
LootTooltip="武器部件能使小精灵让目标恐慌。"

[GrimyDistortion_SupGremlin X2WeaponUpgradeTemplate]
FriendlyName="终极扭曲协议"
FriendlyNamePlural="终极扭曲协议"
BriefSummary="扭曲协议使用次数 +3 （让目标恐慌）。"
TinySummary="提升扭曲协议使用次数"
LootTooltip="武器部件能使小精灵让目标恐慌。"

[GrimyTargetingProtocol_BscGremlin X2WeaponUpgradeTemplate]
FriendlyName="校准协议"
FriendlyNamePlural="校准协议"
BriefSummary="援助协议提供给予友军 +5% 命中和暴击率，持续 1 回合。"
TinySummary="援助协议提供给予命中和暴击率"
LootTooltip="武器部件能使援助协议提供给予命中和暴击率"

[GrimyTargetingProtocol_AdvGremlin X2WeaponUpgradeTemplate]
FriendlyName="高级校准协议"
FriendlyNamePlural="高级校准协议"
BriefSummary="援助协议提供给予友军 +10% 命中和暴击率，持续 1 回合。"
TinySummary="援助协议提供给予命中和暴击率"
LootTooltip="武器部件能使援助协议提供给予命中和暴击率"

[GrimyTargetingProtocol_SupGremlin X2WeaponUpgradeTemplate]
FriendlyName="终极校准协议"
FriendlyNamePlural="终极校准协议"
BriefSummary="援助协议提供给予友军 +15% 命中和暴击率，持续 1 回合。"
TinySummary="援助协议提供给予命中和暴击率"
LootTooltip="武器部件能使援助协议提供给予命中和暴击率"

[GrimyMascot_BscGremlin X2WeaponUpgradeTemplate]
FriendlyName="吉祥物协议"
FriendlyNamePlural="吉祥物协议"
BriefSummary="吉祥物协议使用次数 +1 （给予友军一个行动点）。"
TinySummary="提升吉祥物协议使用次数"
LootTooltip="武器部件提升吉祥物协议使用次数。"

[GrimyMascot_AdvGremlin X2WeaponUpgradeTemplate]
FriendlyName="高级吉祥物协议"
FriendlyNamePlural="高级吉祥物协议"
BriefSummary="吉祥物协议使用次数 +2 （给予友军一个行动点）。"
TinySummary="提升吉祥物协议使用次数"
LootTooltip="武器部件提升吉祥物协议使用次数。"

[GrimyMascot_SupGremlin X2WeaponUpgradeTemplate]
FriendlyName="终极吉祥物协议"
FriendlyNamePlural="终极吉祥物协议"
BriefSummary="吉祥物协议使用次数 +3 （给予友军一个行动点）。"
TinySummary="提升吉祥物协议使用次数"
LootTooltip="武器部件提升吉祥物协议使用次数。"

[GrimyMjolnir_BscGremlin X2WeaponUpgradeTemplate]
FriendlyName="雷神之锤协议"
FriendlyNamePlural="雷神之锤协议"
BriefSummary="电容器放电使用次数 +1，需要电容器放电技能。"
TinySummary="提升电容器放电使用次数"
LootTooltip="武器部件提升电容器放电使用次数。"

[GrimyMjolnir_AdvGremlin X2WeaponUpgradeTemplate]
FriendlyName="高级雷神之锤协议"
FriendlyNamePlural="高级雷神之锤协议"
BriefSummary="电容器放电使用次数 +2，需要电容器放电技能。"
TinySummary="提升电容器放电使用次数"
LootTooltip="武器部件提升电容器放电使用次数。"

[GrimyMjolnir_SupGremlin X2WeaponUpgradeTemplate]
FriendlyName="终极雷神之锤协议"
FriendlyNamePlural="终极雷神之锤协议"
BriefSummary="电容器放电使用次数 +3，需要电容器放电技能。"
TinySummary="提升电容器放电使用次数"
LootTooltip="武器部件提升电容器放电使用次数。"

[GrimyAegis_BscGremlin X2WeaponUpgradeTemplate]
FriendlyName="雅典娜之盾协议"
FriendlyNamePlural="雅典娜之盾协议"
BriefSummary="雅典娜之盾协议使用次数 +1 （给予附近友军 6 点护甲值，持续 4 回合）。"
TinySummary="提升雅典娜之盾协议使用次数"
LootTooltip="武器部件能使小精灵同时保护多个友军。"

[GrimyAegis_AdvGremlin X2WeaponUpgradeTemplate]
FriendlyName="高级雅典娜之盾协议"
FriendlyNamePlural="高级雅典娜之盾协议"
BriefSummary="雅典娜之盾协议使用次数 +2 （给予附近友军 6 点护甲值，持续 4 回合）。"
TinySummary="提升雅典娜之盾协议使用次数"
LootTooltip="武器部件能使小精灵同时保护多个友军。"

[GrimyAegis_SupGremlin X2WeaponUpgradeTemplate]
FriendlyName="终极雅典娜之盾协议"
FriendlyNamePlural="终极雅典娜之盾协议"
BriefSummary="雅典娜之盾协议使用次数 +3 （给予附近友军 6 点护甲值，持续 4 回合）。"
TinySummary="提升雅典娜之盾协议使用次数"
LootTooltip="武器部件能使小精灵同时保护多个友军。"

[GrimyBastion_BscGremlin X2WeaponUpgradeTemplate]
FriendlyName="堡垒协议"
FriendlyNamePlural="堡垒协议"
BriefSummary="周围5格内友军每回合回复 1 点 HP。"
TinySummary="治疗友军"
LootTooltip="武器部件能使小精灵治疗附近友军。"

[GrimyBastion_AdvGremlin X2WeaponUpgradeTemplate]
FriendlyName="高级堡垒协议"
FriendlyNamePlural="高级堡垒协议"
BriefSummary="周围5格内友军每回合回复 2 点 HP。"
TinySummary="治疗友军"
LootTooltip="武器部件能使小精灵治疗附近友军。"

[GrimyBastion_SupGremlin X2WeaponUpgradeTemplate]
FriendlyName="终极堡垒协议"
FriendlyNamePlural="终极堡垒协议"
BriefSummary="周围5格内友军每回合回复 3 点 HP。"
TinySummary="治疗友军"
LootTooltip="武器部件能使小精灵治疗附近友军。"

[GrimySquadTargeting_BscGremlin X2WeaponUpgradeTemplate]
FriendlyName="共享校准协议"
FriendlyNamePlural="共享校准协议"
BriefSummary="共享校准协议使用次数 +1（给予附近友军 15% 命中和暴击率，持续 1 回合）。"
TinySummary="提升共享校准协议使用次数"
LootTooltip="武器部件能使小精灵协助多个友军校准目标。"

[GrimySquadTargeting_AdvGremlin X2WeaponUpgradeTemplate]
FriendlyName="高级共享校准协议"
FriendlyNamePlural="高级共享校准协议"
BriefSummary="共享校准协议使用次数 +2（给予附近友军 15% 命中和暴击率，持续 1 回合）。"
TinySummary="提升共享校准协议使用次数"
LootTooltip="武器部件能使小精灵协助多个友军校准目标。"

[GrimySquadTargeting_SupGremlin X2WeaponUpgradeTemplate]
FriendlyName="终极共享校准协议"
FriendlyNamePlural="终极共享校准协议"
BriefSummary="共享校准协议使用次数 +3（给予附近友军 15% 命中和暴击率，持续 1 回合）。"
TinySummary="提升共享校准协议使用次数"
LootTooltip="武器部件能使小精灵协助多个友军校准目标。"

[GrimyHEAT_BscGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="高温弹药"
FriendlyNamePlural="高温弹药"
BriefSummary="榴弹穿甲能力 +1."
TinySummary="提升榴弹穿甲能力"
LootTooltip="武器部件提升榴弹穿甲能力。"

[GrimyHEAT_AdvGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="高级高温弹药"
FriendlyNamePlural="高级高温弹药"
BriefSummary="榴弹穿甲能力 +2."
TinySummary="提升榴弹穿甲能力"
LootTooltip="武器部件提升榴弹穿甲能力。"

[GrimyHEAT_SupGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="终极高温弹药"
FriendlyNamePlural="终极高温弹药"
BriefSummary="榴弹穿甲能力 +3."
TinySummary="提升榴弹穿甲能力"
LootTooltip="武器部件提升榴弹穿甲能力。"

[GrimyCorrosive_BscGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="腐蚀弹片"
FriendlyNamePlural="腐蚀弹片"
BriefSummary="榴弹碎甲能力 +1."
TinySummary="提升榴弹碎甲能力"
LootTooltip="武器部件提升榴弹碎甲能力。"

[GrimyCorrosive_AdvGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="高级腐蚀弹片"
FriendlyNamePlural="高级腐蚀弹片"
BriefSummary="榴弹碎甲能力 +2."
TinySummary="提升榴弹碎甲能力"
LootTooltip="武器部件提升榴弹碎甲能力。"

[GrimyCorrosive_SupGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="终极腐蚀弹片"
FriendlyNamePlural="终极腐蚀弹片"
BriefSummary="榴弹碎甲能力 +3."
TinySummary="提升榴弹碎甲能力"
LootTooltip="武器部件提升榴弹碎甲能力。"

[GrimyHairTrigger_BscGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="榴弹发射器扳机"
FriendlyNamePlural="榴弹发射器扳机"
BriefSummary="发射时有 5% 几率不消耗行动点。"
TinySummary="提升行动点"
LootTooltip="武器部件有小几率不消耗行动点。"

[GrimyHairTrigger_AdvGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="高级榴弹发射器扳机"
FriendlyNamePlural="高级榴弹发射器扳机"
BriefSummary="发射时有 10% 几率不消耗行动点。"
TinySummary="提升行动点"
LootTooltip="武器部件有小几率不消耗行动点。"

[GrimyHairTrigger_SupGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="终极榴弹发射器扳机"
FriendlyNamePlural="终极榴弹发射器扳机"
BriefSummary="发射时有 15% 几率不消耗行动点。"
TinySummary="提升行动点"
LootTooltip="武器部件有小几率不消耗行动点。"

[GrimyLiquidExplosive_BscGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="液体炸药"
FriendlyNamePlural="液体炸药"
BriefSummary="榴弹暴击率 +10%，暴击伤害 +2。"
TinySummary="提升榴弹暴击率和暴击伤害"
LootTooltip="武器部件提升榴弹暴击率和暴击伤害。"

[GrimyLiquidExplosive_AdvGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="高级液体炸药"
FriendlyNamePlural="高级液体炸药"
BriefSummary="榴弹暴击率 +20%，暴击伤害 +2。"
TinySummary="提升榴弹暴击率和暴击伤害"
LootTooltip="武器部件提升榴弹暴击率和暴击伤害。"

[GrimyLiquidExplosive_SupGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="终极液体炸药"
FriendlyNamePlural="终极液体炸药"
BriefSummary="榴弹暴击率 +30%，暴击伤害 +2。"
TinySummary="提升榴弹暴击率和暴击伤害"
LootTooltip="武器部件提升榴弹暴击率和暴击伤害。"

[GrimyDangerClose_BscGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="高密炸药"
FriendlyNamePlural="高密炸药"
BriefSummary="榴弹发射器发射距离 -60%，榴弹爆炸范围 +2, 伤害 +1。"
TinySummary="提升榴弹爆炸范围和伤害，降低发射距离"
LootTooltip="武器部件提升榴弹爆炸范围和伤害，降低发射距离。"

[GrimyDangerClose_AdvGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="高级高密炸药"
FriendlyNamePlural="高级高密炸药"
BriefSummary="榴弹发射器发射距离 -50%，榴弹爆炸范围 +2, 伤害 +1。"
TinySummary="提升榴弹爆炸范围和伤害，降低发射距离"
LootTooltip="武器部件提升榴弹爆炸范围和伤害，降低发射距离。"

[GrimyDangerClose_SupGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="终极高密炸药"
FriendlyNamePlural="终极高密炸药"
BriefSummary="榴弹发射器发射距离 -40%，榴弹爆炸范围 +2, 伤害 +1。"
TinySummary="提升榴弹爆炸范围和伤害，降低发射距离"
LootTooltip="武器部件提升榴弹爆炸范围和伤害，降低发射距离。"

[GrimyLongshotPropellant_BscGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="远射推进剂"
FriendlyNamePlural="远射推进剂"
BriefSummary="榴弹发射距离 +20%."
TinySummary="提升榴弹攻击距离"
LootTooltip="武器部件提升榴弹攻击距离。"

[GrimyLongshotPropellant_AdvGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="高级远射推进剂"
FriendlyNamePlural="高级远射推进剂"
BriefSummary="榴弹发射距离 +25%."
TinySummary="提升榴弹攻击距离"
LootTooltip="武器部件提升榴弹攻击距离。"

[GrimyLongshotPropellant_SupGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="终极远射推进剂"
FriendlyNamePlural="终极远射推进剂"
BriefSummary="榴弹发射距离 +30%."
TinySummary="提升榴弹攻击距离"
LootTooltip="武器部件提升榴弹攻击距离。"

[GrimyAirBurst_BscGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="空爆引信"
FriendlyNamePlural="空爆引信"
BriefSummary="榴弹爆炸范围 +0.5。"
TinySummary="提升榴弹爆炸范围"
LootTooltip="武器部件提升榴弹爆炸范围。"

[GrimyAirBurst_AdvGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="高级空爆引信"
FriendlyNamePlural="高级空爆引信"
BriefSummary="榴弹爆炸范围 +0.75。"
TinySummary="提升榴弹爆炸范围"
LootTooltip="武器部件提升榴弹爆炸范围。"

[GrimyAirBurst_SupGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="终极空爆引信"
FriendlyNamePlural="终极空爆引信"
BriefSummary="榴弹爆炸范围 +1。"
TinySummary="提升榴弹爆炸范围"
LootTooltip="武器部件提升榴弹爆炸范围。"

[GrimyFragSatchel_BscGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="手雷包"
FriendlyNamePlural="手雷包"
BriefSummary="每个格子增加碎片手雷携带量 1。"
TinySummary="增加碎片手雷携带量"
LootTooltip="武器部件增加碎片手雷携带量。"

[GrimyFragSatchel_AdvGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="高级手雷包"
FriendlyNamePlural="高级手雷包"
BriefSummary="每个格子增加碎片手雷携带量 2。"
TinySummary="增加碎片手雷携带量"
LootTooltip="武器部件增加碎片手雷携带量。"

[GrimyFragSatchel_SupGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="终极手雷包"
FriendlyNamePlural="终极手雷包"
BriefSummary="每个格子增加碎片手雷携带量 3。"
TinySummary="增加碎片手雷携带量"
LootTooltip="武器部件增加碎片手雷携带量。"

[GrimySmokeSatchel_BscGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="烟雾手雷包"
FriendlyNamePlural="烟雾手雷包"
BriefSummary="每个格子增加烟雾手雷携带量 1 。"
TinySummary="增加烟雾手雷携带量"
LootTooltip="武器部件增加烟雾手雷携带量。"

[GrimySmokeSatchel_AdvGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="高级烟雾手雷包"
FriendlyNamePlural="高级烟雾手雷包"
BriefSummary="每个格子增加烟雾手雷携带量 2 。"
TinySummary="增加烟雾手雷携带量"
LootTooltip="武器部件增加烟雾手雷携带量。"

[GrimySmokeSatchel_SupGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="终极烟雾手雷包"
FriendlyNamePlural="终极烟雾手雷包"
BriefSummary="每个格子增加烟雾手雷携带量 3 。"
TinySummary="增加烟雾手雷携带量"
LootTooltip="武器部件增加烟雾手雷携带量。"

[GrimyHydraBarrel_BscGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="九头蛇炮筒"
FriendlyNamePlural="九头蛇炮筒"
BriefSummary="减少榴弹爆炸范围 2.5, 增加每格榴弹携弹量到 8。"
TinySummary="提升榴弹携弹量，大幅减少榴弹爆炸范围"
LootTooltip="武器部件提升榴弹携弹量，大幅减少榴弹爆炸范围。"

[GrimyHydraBarrel_AdvGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="高级九头蛇炮筒"
FriendlyNamePlural="高级九头蛇炮筒"
BriefSummary="减少榴弹爆炸范围 2.5, 增加每格榴弹携弹量到 9。"
TinySummary="提升榴弹携弹量，大幅减少榴弹爆炸范围"
LootTooltip="武器部件提升榴弹携弹量，大幅减少榴弹爆炸范围。"

[GrimyHydraBarrel_SupGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="终极九头蛇炮筒"
FriendlyNamePlural="终极九头蛇炮筒"
BriefSummary="减少榴弹爆炸范围 2.5, 增加每格榴弹携弹量到 10。"
TinySummary="提升榴弹携弹量，大幅减少榴弹爆炸范围"
LootTooltip="武器部件提升榴弹携弹量，大幅减少榴弹爆炸范围。"

[GrimyPlagueSatchel_BscGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="瘟疫包"
FriendlyNamePlural="瘟疫包"
BriefSummary="每个格子增加毒气榴弹携带量 1。"
TinySummary="增加毒气榴弹携带量"
LootTooltip="武器部件增加毒气榴弹携带量。"

[GrimyPlagueSatchel_AdvGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="高级瘟疫包"
FriendlyNamePlural=高级"瘟疫包"
BriefSummary="每个格子增加毒气榴弹携带量 2。"
TinySummary="增加毒气榴弹携带量"
LootTooltip="武器部件增加毒气榴弹携带量。"

[GrimyPlagueSatchel_SupGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="终极瘟疫包"
FriendlyNamePlural="终极瘟疫包"
BriefSummary="每个格子增加毒气榴弹携带量 3。"
TinySummary="增加毒气榴弹携带量"
LootTooltip="武器部件增加毒气榴弹携带量。"

[GrimyRiotSatchel_BscGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="混乱包"
FriendlyNamePlural="混乱包"
BriefSummary="每个格子增加闪光榴弹携带量 1 。"
TinySummary="增加闪光榴弹携带量"
LootTooltip="武器部件增加闪光榴弹携带量。"

[GrimyRiotSatchel_AdvGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="高级混乱包"
FriendlyNamePlural="高级混乱包"
BriefSummary="每个格子增加闪光榴弹携带量 2 。"
TinySummary="增加闪光榴弹携带量"
LootTooltip="武器部件增加闪光榴弹携带量。"

[GrimyRiotSatchel_SupGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="终极混乱包"
FriendlyNamePlural="终极混乱包"
BriefSummary="每个格子增加闪光榴弹携带量 3 。"
TinySummary="增加闪光榴弹携带量"
LootTooltip="武器部件增加闪光榴弹携带量。"

[GrimySapperSatchel_BscGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="工兵包"
FriendlyNamePlural="工兵包"
BriefSummary="增加所有榴弹携带量 1。"
TinySummary="增加所有榴弹携带量"
LootTooltip="武器部件增加所有榴弹携带量。"

[GrimySapperSatchel_AdvGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="高级工兵包"
FriendlyNamePlural="高级工兵包"
BriefSummary="增加所有榴弹携带量 2。"
TinySummary="增加所有榴弹携带量"
LootTooltip="武器部件增加所有榴弹携带量。"

[GrimySapperSatchel_SupGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="终极工兵包"
FriendlyNamePlural="终极工兵包"
BriefSummary="增加所有榴弹携带量 3。"
TinySummary="增加所有榴弹携带量"
LootTooltip="武器部件增加所有榴弹携带量。"

[GrimyPyroSatchel_BscGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="火焰包"
FriendlyNamePlural="火焰包"
BriefSummary="每个格子增加火焰榴弹携带量 1 。"
TinySummary="增加火焰榴弹携带量"
LootTooltip="武器部件增加火焰榴弹携带量。"

[GrimyPyroSatchel_AdvGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="高级火焰包"
FriendlyNamePlural="高级火焰包"
BriefSummary="每个格子增加火焰榴弹携带量 2 。"
TinySummary="增加火焰榴弹携带量"
LootTooltip="武器部件增加火焰榴弹携带量。"

[GrimyPyroSatchel_SupGrenadeLauncher X2WeaponUpgradeTemplate]
FriendlyName="终极火焰包"
FriendlyNamePlural="终极火焰包"
BriefSummary="每个格子增加火焰榴弹携带量 3 。"
TinySummary="增加火焰榴弹携带量"
LootTooltip="武器部件增加火焰榴弹携带量。"

[GrimyChargeFeedbackBsc X2AbilityTemplate]
LocFriendlyName="反馈"
LocHelpText="灵能伤害以一定比例降低目标的灵能"

[GrimyChargeFeedbackAdv X2AbilityTemplate]
LocFriendlyName="高级反馈"
LocHelpText="灵能伤害以一定比例降低目标的灵能"

[GrimyChargeFeedbackSup X2AbilityTemplate]
LocFriendlyName="终极反馈"
LocHelpText="灵能伤害以一定比例降低目标的灵能"

[GrimyChargeTeleportBsc X2AbilityTemplate]
LocFriendlyName="传送"
LocHelpText="传送到新地点。无视监视和反应射击。"

[GrimyChargeTeleportAdv X2AbilityTemplate]
LocFriendlyName="高级传送"
LocHelpText="传送到新地点。无视监视和反应射击。"

[GrimyChargeTeleportSup X2AbilityTemplate]
LocFriendlyName="终极传送"
LocHelpText="传送到新地点。无视监视和反应射击。"

[GrimyChargeReanimationOne X2AbilityTemplate]
LocFriendlyName="灵能复活"
LocHelpText="把死亡的士兵，普通市民或者变种人士兵变成灵能僵尸。"

[GrimyChargeReanimationTwo X2AbilityTemplate]
LocFriendlyName="高级灵能复活"
LocHelpText="把死亡的士兵，普通市民或者变种人士兵变成灵能僵尸。"

[GrimyChargeReanimationThree X2AbilityTemplate]
LocFriendlyName="终极灵能复活"
LocHelpText="把死亡的士兵，普通市民或者变种人士兵变成灵能僵尸。"

[GrimySolaceOne X2AbilityTemplate]
LocFriendlyName="安慰"
LocHelpText="消除5格内来自敌人的所有负状态。"

[GrimySolaceTwo X2AbilityTemplate]
LocFriendlyName="高级安慰"
LocHelpText="消除6格内来自敌人的所有负状态。"

[GrimySolaceThree X2AbilityTemplate]
LocFriendlyName="终极安慰"
LocHelpText="消除7格内来自敌人的所有负状态。"

[GrimyChargeBarrierBsc X2AbilityTemplate]
LocFriendlyName="屏障"
LocHelpText="给予目标5点护盾值"

[GrimyChargeBarrierAdv X2AbilityTemplate]
LocFriendlyName="高级屏障"
LocHelpText="给予目标6点护盾值"

[GrimyChargeBarrierSup X2AbilityTemplate]
LocFriendlyName="终极屏障"
LocHelpText="给予目标7点护盾值"

[GrimyProjector_BscPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="灵能投影"
FriendlyNamePlural="灵能投影"
BriefSummary="灵能攻击 +5."
TinySummary="提升灵能攻击"
LootToolTip="武器部件提升士兵的灵能能力。"

[GrimyProjector_AdvPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="高级灵能投影"
FriendlyNamePlural="高级灵能投影"
BriefSummary="灵能攻击 +10."
TinySummary="提升灵能攻击"
LootToolTip="武器部件提升士兵的灵能能力。"

[GrimyProjector_SupPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="终极灵能投影"
FriendlyNamePlural="终极灵能投影"
BriefSummary="灵能攻击 +15."
TinySummary="提升灵能攻击"
LootToolTip="武器部件提升士兵的灵能能力。"

[GrimyHeavyElerium_BscPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="重铀"
FriendlyNamePlural="重铀"
BriefSummary="灵能伤害 +1, 命中 -5%."
TinySummary="提升灵能伤害，降低命中"
LootToolTip="武器部件增强了灵能士兵的伤害能力，但是更难瞄准了。"

[GrimyHeavyElerium_AdvPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="高级重铀"
FriendlyNamePlural="高级重铀"
BriefSummary="灵能伤害 +2, 命中 -10%."
TinySummary="提升灵能伤害，降低命中"
LootToolTip="武器部件增强了灵能士兵的伤害能力，但是更难瞄准了。"

[GrimyHeavyElerium_SupPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="终极重铀"
FriendlyNamePlural="终极重铀"
BriefSummary="灵能伤害 +3, 命中 -15%."
TinySummary="提升灵能伤害，降低命中"
LootToolTip="武器部件增强了灵能士兵的伤害能力，但是更难瞄准了。"

[GrimyInhibitor_BscPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="灵能继承"
FriendlyNamePlural="灵能继承"
BriefSummary="意志力 +15."
TinySummary="提升意志力"
LootToolTip="武器部件增强士兵的灵能防御能力。"

[GrimyInhibitor_AdvPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="高级灵能继承"
FriendlyNamePlural="高级灵能继承"
BriefSummary="意志力 +30."
TinySummary="提升意志力"
LootToolTip="武器部件增强士兵的灵能防御能力。"

[GrimyInhibitor_SupPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="终极灵能继承"
FriendlyNamePlural="终极灵能继承"
BriefSummary="意志力 +45."
TinySummary="提升意志力"
LootToolTip="武器部件增强士兵的灵能防御能力。"

[GrimyAura_BscPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="预兆"
FriendlyNamePlural="预兆"
BriefSummary="安慰范围 +1."
TinySummary="提升安慰范围"
LootToolTip="武器部件提升灵能士兵的安慰能力。"

[GrimyAura_AdvPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="高级预兆"
FriendlyNamePlural="高级预兆"
BriefSummary="安慰范围 +2."
TinySummary="提升安慰范围"
LootToolTip="武器部件提升灵能士兵的安慰能力。"

[GrimyAura_SupPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="终极预兆"
FriendlyNamePlural="终极预兆"
BriefSummary="安慰范围 +3."
TinySummary="提升安慰范围"
LootToolTip="武器部件提升灵能士兵的安慰能力。"

[GrimyReanimation_BscPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="灵能复活组件"
FriendlyNamePlural="灵能复活组件"
BriefSummary="灵能复活使用次数 +1。"
TinySummary="灵能复活能力"
LootToolTip="武器部件可以复活尸体。"

[GrimyReanimation_AdvPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="高级灵能复活组件"
FriendlyNamePlural="高级灵能复活组件"
BriefSummary="灵能复活使用次数 +2。"
TinySummary="灵能复活能力"
LootToolTip="武器部件可以复活尸体。"

[GrimyReanimation_SupPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="终极灵能复活组件"
FriendlyNamePlural="终极灵能复活组件"
BriefSummary="灵能复活使用次数 +3。"
TinySummary="灵能复活能力"
LootToolTip="武器部件可以复活尸体。"

[GrimyMindblast_BscPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="头脑风暴组件"
FriendlyNamePlural="头脑风暴组件"
BriefSummary="升级灵魂火技能，使用次数 3 。"
TinySummary="增强灵魂火"
LootToolTip="武器部件升级灵能士兵的灵魂火技能。"

[GrimyMindblast_AdvPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="高级头脑风暴组件"
FriendlyNamePlural="高级头脑风暴组件"
BriefSummary="升级灵魂火技能，使用次数 4 。"
TinySummary="增强灵魂火"
LootToolTip="武器部件升级灵能士兵的灵魂火技能。"

[GrimyMindblast_SupPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="终极头脑风暴组件"
FriendlyNamePlural="终极头脑风暴组件"
BriefSummary="升级灵魂火技能，使用次数 5 。"
TinySummary="增强灵魂火"
LootToolTip="武器部件升级灵能士兵的灵魂火技能。"

[GrimyDistortion_BscPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="扭曲力场组件"
FriendlyNamePlural="扭曲力场组件"
BriefSummary="升级错乱技能，使用次数 2。"
TinySummary="增强错乱"
LootToolTip="武器部件升级灵能士兵的错乱技能。"

[GrimyDistortion_AdvPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="高级扭曲力场组件"
FriendlyNamePlural="高级扭曲力场组件"
BriefSummary="升级错乱技能，使用次数 3。"
TinySummary="增强错乱"
LootToolTip="武器部件升级灵能士兵的错乱技能。"

[GrimyDistortion_SupPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="终极扭曲力场组件"
FriendlyNamePlural="终极扭曲力场组件"
BriefSummary="升级错乱技能，使用次数 4。"
TinySummary="增强错乱"
LootToolTip="武器部件升级灵能士兵的错乱技能。"

[GrimyBarrier_BscPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="屏障组件"
FriendlyNamePlural="屏障组件"
BriefSummary="屏障使用次数 +3（给予目标5点护盾值），持续 3 回合。"
TinySummary="屏障技能"
LootToolTip="武器部件提供屏障技能。"

[GrimyBarrier_AdvPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="高级屏障组件"
FriendlyNamePlural="高级屏障组件"
BriefSummary="屏障使用次数 +3（给予目标6点护盾值），持续 3 回合。"
TinySummary="屏障技能"
LootToolTip="武器部件提供屏障技能。"

[GrimyBarrier_SupPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="终极屏障组件"
FriendlyNamePlural="终极屏障组件"
BriefSummary="屏障使用次数 +3（给予目标7点护盾值），持续 3 回合。"
TinySummary="屏障技能"
LootToolTip="武器部件提供屏障技能。"

[GrimyFeedback_BscPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="反馈组件"
FriendlyNamePlural="反馈组件"
BriefSummary="反馈使用次数 +1 （灵能伤害以一定比例降低目标的灵能）。"
TinySummary="反馈技能"
LootToolTip="武器部件提供反馈技能。"

[GrimyFeedback_AdvPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="高级反馈组件"
FriendlyNamePlural="高级反馈组件"
BriefSummary="反馈使用次数 +2 （灵能伤害以一定比例降低目标的灵能）。"
TinySummary="反馈技能"
LootToolTip="武器部件提供反馈技能。"

[GrimyFeedback_SupPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="终极反馈组件"
FriendlyNamePlural="终极反馈组件"
BriefSummary="反馈使用次数 +3 （灵能伤害以一定比例降低目标的灵能）。"
TinySummary="反馈技能"
LootToolTip="武器部件提供反馈技能。"

[GrimyNavigator_BscPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="导航组件"
FriendlyNamePlural="导航组件"
BriefSummary="传送使用次数 +1。"
TinySummary="传送技能"
LootToolTip="武器部件提供传送技能。"

[GrimyNavigator_AdvPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="高级导航组件"
FriendlyNamePlural="高级导航组件"
BriefSummary="传送使用次数 +2。"
TinySummary="传送技能"
LootToolTip="武器部件提供传送技能。"

[GrimyNavigator_SupPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="终极导航组件"
FriendlyNamePlural="终极导航组件"
BriefSummary="传送使用次数 +3。"
TinySummary="传送技能"
LootToolTip="武器部件提供传送技能。"

[GrimySympathy_BscPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="感应组件"
FriendlyNamePlural="感应组件"
BriefSummary="升级鼓舞技能，使用次数 2。"
TinySummary="增强鼓舞"
LootToolTip="武器部件能使鼓舞技能提供 2 个行动点。"

[GrimySympathy_AdvPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="高级感应组件"
FriendlyNamePlural="高级感应组件"
BriefSummary="升级鼓舞技能，使用次数 3。"
TinySummary="增强鼓舞"
LootToolTip="武器部件能使鼓舞技能提供 2 个行动点。"

[GrimySympathy_SupPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="终极感应组件"
FriendlyNamePlural="终极感应组件"
BriefSummary="升级鼓舞技能，使用次数 4。"
TinySummary="增强鼓舞"
LootToolTip="武器部件能使鼓舞技能提供 2 个行动点。"

[GrimyNeural_BscPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="终和网络"
FriendlyNamePlural="终和网络"
BriefSummary="每次任务提供额外一次支配技能使用。"
TinySummary="支配技能增强"
LootToolTip="武器部件能使灵能士兵使用多次支配技能。"

[GrimyNeural_AdvPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="高级终和网络"
FriendlyNamePlural="高级终和网络"
BriefSummary="每次任务提供额外一次支配技能使用，技能冷却回合 -1。"
TinySummary="支配技能增强"
LootToolTip="武器部件能使灵能士兵使用多次支配技能。"

[GrimyNeural_SupPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="终极终和网络"
FriendlyNamePlural="终极终和网络"
BriefSummary="每次任务提供额外一次支配技能使用，技能冷却回合 -2。"
TinySummary="支配技能增强"
LootToolTip="武器部件能使灵能士兵使用多次支配技能。"

[GrimyRealitySink_BscPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="现实沦陷"
FriendlyNamePlural="现实沦陷"
BriefSummary="虚无之矛使用次数 +1 。"
TinySummary="升级虚无之矛"
LootToolTip="武器部件升级灵能士兵的虚无之矛技能。"

[GrimyRealitySink_AdvPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="高级现实沦陷"
FriendlyNamePlural="高级现实沦陷"
BriefSummary="虚无之矛使用次数 +2 。"
TinySummary="升级虚无之矛"
LootToolTip="武器部件升级灵能士兵的虚无之矛技能。"

[GrimyRealitySink_SupPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="终极现实沦陷"
FriendlyNamePlural="终极现实沦陷"
BriefSummary="虚无之矛使用次数 +3 。"
TinySummary="升级虚无之矛"
LootToolTip="武器部件升级灵能士兵的虚无之矛技能。"

[GrimyVoidAnchor_BscPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="虚空之锚"
FriendlyNamePlural="虚空之锚"
BriefSummary="虚空裂痕使用次数 +1。"
TinySummary="增强虚空裂痕"
LootToolTip="武器部件升级灵能士兵的虚空裂痕技能。"

[GrimyVoidAnchor_AdvPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="高级虚空之锚"
FriendlyNamePlural="高级虚空之锚"
BriefSummary="虚空裂痕使用次数 +2。"
TinySummary="增强虚空裂痕"
LootToolTip="武器部件升级灵能士兵的虚空裂痕技能。"

[GrimyVoidAnchor_SupPsiAmp X2WeaponUpgradeTemplate]
FriendlyName="终极虚空之锚"
FriendlyNamePlural="终极虚空之锚"
BriefSummary="虚空裂痕使用次数 +3。"
TinySummary="增强虚空裂痕"
LootToolTip="武器部件升级灵能士兵的虚空裂痕技能。"

[GrimyTacticalSensors_BscArmor X2WeaponUpgradeTemplate]
FriendlyName="战术感应"
FriendlyNamePlural="战术感应"
BriefSummary="周围8格内有敌人攻击则防御 +5%。"
TinySummary="提升近敌防御"
LootToolTip="武器部件提升近敌防御, 只用于护甲上。"

[GrimyTacticalSensors_AdvArmor X2WeaponUpgradeTemplate]
FriendlyName="高级战术感应"
FriendlyNamePlural="高级战术感应"
BriefSummary="周围8格内有敌人攻击则防御 +10%。"
TinySummary="提升近敌防御"
LootToolTip="武器部件提升近敌防御, 只用于护甲上。"

[GrimyTacticalSensors_SupArmor X2WeaponUpgradeTemplate]
FriendlyName="终极战术感应"
FriendlyNamePlural="终极战术感应"
BriefSummary="周围8格内有敌人攻击则防御 +15%。"
TinySummary="提升近敌防御"
LootToolTip="武器部件提升近敌防御, 只用于护甲上。"

[GrimyReactiveSensors_BscArmor X2WeaponUpgradeTemplate]
FriendlyName="反应感应"
FriendlyNamePlural="反应感应"
BriefSummary="视野中每出现一个敌人，防御 +5%，最高 +15%。"
TinySummary="防御随视野敌人数目提升"
LootToolTip="武器部件能使防御随视野敌人数目提升。"

[GrimyReactiveSensors_AdvArmor X2WeaponUpgradeTemplate]
FriendlyName="高级反应感应"
FriendlyNamePlural="高级反应感应"
BriefSummary="视野中每出现一个敌人，防御 +5%，最高 +20%。"
TinySummary="防御随视野敌人数目提升"
LootToolTip="武器部件能使防御随视野敌人数目提升。"

[GrimyReactiveSensors_SupArmor X2WeaponUpgradeTemplate]
FriendlyName="终极反应感应"
FriendlyNamePlural="终极反应感应"
BriefSummary="视野中每出现一个敌人，防御 +5%，最高 +25%。"
TinySummary="防御随视野敌人数目提升"
LootToolTip="武器部件能使防御随视野敌人数目提升。"

[GrimyBlastPadding_BscArmor X2WeaponUpgradeTemplate]
FriendlyName="防爆背心"
FriendlyNamePlural="防爆背心"
BriefSummary="护甲值 +1，爆炸所受伤害 -50%。"
TinySummary="提升护甲值和爆炸抵抗力"
LootToolTip="武器部件提升护甲值和爆炸抵抗力"

[GrimyBlastPadding_AdvArmor X2WeaponUpgradeTemplate]
FriendlyName="高级防爆背心"
FriendlyNamePlural="高级防爆背心"
BriefSummary="护甲值 +1，爆炸所受伤害 -70%。"
TinySummary="提升护甲值和爆炸抵抗力"
LootToolTip="武器部件提升护甲值和爆炸抵抗力"

[GrimyBlastPadding_SupArmor X2WeaponUpgradeTemplate]
FriendlyName="终极防爆背心"
FriendlyNamePlural="终极防爆背心"
BriefSummary="护甲值 +1，爆炸所受伤害 -90%。"
TinySummary="提升护甲值和爆炸抵抗力"
LootToolTip="武器部件提升护甲值和爆炸抵抗力"

[GrimyHardpoints_BscArmor X2WeaponUpgradeTemplate]
FriendlyName="外挂甲"
FriendlyNamePlural="外挂甲"
BriefSummary="被暴击率 -5%."
TinySummary="提升暴击抵抗力"
LootToolTip="武器部件提升暴击抵抗力。"

[GrimyHardpoints_AdvArmor X2WeaponUpgradeTemplate]
FriendlyName="高级外挂甲"
FriendlyNamePlural="高级外挂甲"
BriefSummary="被暴击率 -10%."
TinySummary="提升暴击抵抗力"
LootToolTip="武器部件提升暴击抵抗力。"

[GrimyHardpoints_SupArmor X2WeaponUpgradeTemplate]
FriendlyName="终极外挂甲"
FriendlyNamePlural="终极外挂甲"
BriefSummary="被暴击率 -15%."
TinySummary="提升暴击抵抗力"
LootToolTip="武器部件提升暴击抵抗力。"

[GrimyFlexweave_BscArmor X2WeaponUpgradeTemplate]
FriendlyName="活性布料"
FriendlyNamePlural="活性布料"
BriefSummary="移动力 +1。"
TinySummary="提升移动力和闪避能力"
LootToolTip="武器部件提升移动力和闪避能力。"

[GrimyFlexweave_AdvArmor X2WeaponUpgradeTemplate]
FriendlyName="高级活性布料"
FriendlyNamePlural="高级活性布料"
BriefSummary="移动力 +1，闪避 +10%。"
TinySummary="提升移动力和闪避能力"
LootToolTip="武器部件提升移动力和闪避能力。"

[GrimyFlexweave_SupArmor X2WeaponUpgradeTemplate]
FriendlyName="终极活性布料"
FriendlyNamePlural="终极活性布料"
BriefSummary="移动力 +1，闪避 +20%。"
TinySummary="提升移动力和闪避能力"
LootToolTip="武器部件提升移动力和闪避能力。"

[GrimyUndervest_BscArmor X2WeaponUpgradeTemplate]
FriendlyName="内衣"
FriendlyNamePlural="内衣"
BriefSummary="HP +1."
TinySummary="提升HP"
LootToolTip="武器部件只用于护甲，提升生存能力。"

[GrimyUndervest_AdvArmor X2WeaponUpgradeTemplate]
FriendlyName="高级内衣"
FriendlyNamePlural="高级内衣"
BriefSummary="HP +2."
TinySummary="提升HP"
LootToolTip="武器部件只用于护甲，提升生存能力。"

[GrimyUndervest_SupArmor X2WeaponUpgradeTemplate]
FriendlyName="终极内衣"
FriendlyNamePlural="终极内衣"
BriefSummary="HP +3."
TinySummary="提升HP"
LootToolTip="武器部件只用于护甲，提升生存能力。"

[GrimyMagDeflectors_BscArmor X2WeaponUpgradeTemplate]
FriendlyName="消磁器"
FriendlyNamePlural="消磁器"
BriefSummary="所受磁力武器伤害 -20%."
TinySummary="提升对变种人磁力武器的抵抗力"
LootToolTip="武器部件只用于护甲，提升对变种人磁力武器的抵抗力。"

[GrimyMagDeflectors_AdvArmor X2WeaponUpgradeTemplate]
FriendlyName="高级消磁器"
FriendlyNamePlural="高级消磁器"
BriefSummary="所受磁力武器伤害 -25%."
TinySummary="提升对变种人磁力武器的抵抗力"
LootToolTip="武器部件只用于护甲，提升对变种人磁力武器的抵抗力。"

[GrimyMagDeflectors_SupArmor X2WeaponUpgradeTemplate]
FriendlyName="终极消磁器"
FriendlyNamePlural="终极消磁器"
BriefSummary="所受磁力武器伤害 -30%."
TinySummary="提升对变种人磁力武器的抵抗力"
LootToolTip="武器部件只用于护甲，提升对变种人磁力武器的抵抗力。"

[GrimyEnergyDiffuser_BscArmor X2WeaponUpgradeTemplate]
FriendlyName="能量分散"
FriendlyNamePlural="能量分散"
BriefSummary="所受电浆武器伤害 -20%."
TinySummary="提升对变种人电浆武器的抵抗力"
LootToolTip="武器部件只用于护甲，提升对变种人电浆武器的抵抗力。"

[GrimyEnergyDiffuser_AdvArmor X2WeaponUpgradeTemplate]
FriendlyName="高级能量分散"
FriendlyNamePlural="高级能量分散"
BriefSummary="所受电浆武器伤害 -25%."
TinySummary="提升对变种人电浆武器的抵抗力"
LootToolTip="武器部件只用于护甲，提升对变种人电浆武器的抵抗力。"

[GrimyEnergyDiffuser_SupArmor X2WeaponUpgradeTemplate]
FriendlyName="终极能量分散"
FriendlyNamePlural="终极能量分散"
BriefSummary="所受电浆武器伤害 -30%."
TinySummary="提升对变种人电浆武器的抵抗力"
LootToolTip="武器部件只用于护甲，提升对变种人电浆武器的抵抗力。"

[GrimyShieldBattery_BscArmor X2WeaponUpgradeTemplate]
FriendlyName="护盾电池"
FriendlyNamePlural="护盾电池"
BriefSummary="每任务 1 次, 提供 5 护盾值，持续 3 回合。"
TinySummary="应急专用护盾"
LootToolTip="武器部件能使使用者危急时保住命。"

[GrimyShieldBattery_AdvArmor X2WeaponUpgradeTemplate]
FriendlyName="高级护盾电池"
FriendlyNamePlural="高级护盾电池"
BriefSummary="每任务 2 次, 提供 5 护盾值，持续 3 回合。"
TinySummary="应急专用护盾"
LootToolTip="武器部件能使使用者危急时保住命。"

[GrimyShieldBattery_SupArmor X2WeaponUpgradeTemplate]
FriendlyName="终极护盾电池"
FriendlyNamePlural="终极护盾电池"
BriefSummary="每任务 3 次, 提供 5 护盾值，持续 3 回合。"
TinySummary="应急专用护盾"
LootToolTip="武器部件能使使用者危急时保住命。"

[GrimyLegServos_BscArmor X2WeaponUpgradeTemplate]
FriendlyName="飞毛腿"
FriendlyNamePlural="飞毛腿"
BriefSummary="每任务 1 次，移动力 +3，持续 1 回合。"
TinySummary="未知敌人中神行太保技能"
LootToolTip="武器部件提供短暂的快速移动能力。"

[GrimyLegServos_AdvArmor X2WeaponUpgradeTemplate]
FriendlyName="高级飞毛腿"
FriendlyNamePlural="高级飞毛腿"
BriefSummary="每任务 2 次，移动力 +3，持续 1 回合。"
TinySummary="未知敌人中神行太保技能"
LootToolTip="武器部件提供短暂的快速移动能力。"

[GrimyLegServos_SupArmor X2WeaponUpgradeTemplate]
FriendlyName="终极飞毛腿"
FriendlyNamePlural="终极飞毛腿"
BriefSummary="每任务 3 次，移动力 +3，持续 1 回合。"
TinySummary="未知敌人中神行太保技能"
LootToolTip="武器部件提供短暂的快速移动能力。"

[GrimyDigitalCamo_BscArmor X2WeaponUpgradeTemplate]
FriendlyName="数值化伪装"
FriendlyNamePlural="数值化伪装"
BriefSummary="降低敌人侦测范围 10%."
TinySummary="降低敌人侦测范围"
LootToolTip="武器部件只用于护甲，能使使用者接近敌人不被发现。"

[GrimyDigitalCamo_AdvArmor X2WeaponUpgradeTemplate]
FriendlyName="高级数值化伪装"
FriendlyNamePlural="高级数值化伪装"
BriefSummary="降低敌人侦测范围 20%."
TinySummary="降低敌人侦测范围"
LootToolTip="武器部件只用于护甲，能使使用者接近敌人不被发现。"

[GrimyDigitalCamo_SupArmor X2WeaponUpgradeTemplate]
FriendlyName="终极数值化伪装"
FriendlyNamePlural="终极数值化伪装"
BriefSummary="降低敌人侦测范围 30%."
TinySummary="降低敌人侦测范围"
LootToolTip="武器部件只用于护甲，能使使用者接近敌人不被发现。"

[GrimyStasis_BscArmor X2WeaponUpgradeTemplate]
FriendlyName="医疗背心"
FriendlyNamePlural="医疗背心"
BriefSummary="每回合自动恢复 2 HP, 最大恢复 6 HP。"
TinySummary="自动恢复"
LootToolTip="武器部件只用于护甲，能使使用者缓慢恢复HP。"

[GrimyStasis_AdvArmor X2WeaponUpgradeTemplate]
FriendlyName="高级医疗背心"
FriendlyNamePlural="高级医疗背心"
BriefSummary="每回合自动恢复 2 HP, 最大恢复 8 HP。"
TinySummary="自动恢复"
LootToolTip="武器部件只用于护甲，能使使用者缓慢恢复HP。"

[GrimyStasis_SupArmor X2WeaponUpgradeTemplate]
FriendlyName="终极医疗背心"
FriendlyNamePlural="终极医疗背心"
BriefSummary="每回合自动恢复 2 HP, 最大恢复 10 HP。"
TinySummary="自动恢复"
LootToolTip="武器部件只用于护甲，能使使用者缓慢恢复HP。"

[GrimyMediSatchel_BscArmor X2WeaponUpgradeTemplate]
FriendlyName="医疗包"
FriendlyNamePlural="医疗包"
BriefSummary="携带急救包数量 +1."
TinySummary="提升携带急救包数量"
LootToolTip="武器部件只用于护甲，提升携带急救包数量。"

[GrimyMediSatchel_AdvArmor X2WeaponUpgradeTemplate]
FriendlyName="高级医疗包"
FriendlyNamePlural="高级医疗包"
BriefSummary="携带急救包数量 +2."
TinySummary="提升携带急救包数量"
LootToolTip="武器部件只用于护甲，提升携带急救包数量。"

[GrimyMediSatchel_SupArmor X2WeaponUpgradeTemplate]
FriendlyName="终极医疗包"
FriendlyNamePlural="终极医疗包"
BriefSummary="携带急救包数量 +3."
TinySummary="提升携带急救包数量"
LootToolTip="武器部件只用于护甲，提升携带急救包数量。"

[GrimySmokeSatchel_BscArmor X2WeaponUpgradeTemplate]
FriendlyName="烟雾手雷包1"
FriendlyNamePlural="烟雾手雷包"
BriefSummary="增加烟雾手雷携带量 1 。"
TinySummary="增加烟雾手雷携带量"
LootToolTip="武器部件只用于护甲，提升携带烟雾手雷数量。"

[GrimySmokeSatchel_AdvArmor X2WeaponUpgradeTemplate]
FriendlyName="高级烟雾手雷包1"
FriendlyNamePlural="高级烟雾手雷包"
BriefSummary="增加烟雾手雷携带量 2 。"
TinySummary="增加烟雾手雷携带量"
LootToolTip="武器部件只用于护甲，提升携带烟雾手雷数量。"

[GrimySmokeSatchel_SupArmor X2WeaponUpgradeTemplate]
FriendlyName="终极烟雾手雷包1"
FriendlyNamePlural="终极烟雾手雷包"
BriefSummary="增加烟雾手雷携带量 3 。"
TinySummary="增加烟雾手雷携带量"
LootToolTip="武器部件只用于护甲，提升携带烟雾手雷数量。"

[GrimySpotterSatchel_BscArmor X2WeaponUpgradeTemplate]
FriendlyName="侦察兵包"
FriendlyNamePlural="侦察兵包"
BriefSummary="增加战场扫描器携带量 1."
TinySummary="增加战场扫描器携带量"
LootToolTip="武器部件只用于护甲，提升携带战场扫描器数量。"

[GrimySpotterSatchel_AdvArmor X2WeaponUpgradeTemplate]
FriendlyName="高级侦察兵包"
FriendlyNamePlural="高级侦察兵包"
BriefSummary="增加战场扫描器携带量 2."
TinySummary="增加战场扫描器携带量"
LootToolTip="武器部件只用于护甲，提升携带战场扫描器数量。"

[GrimySpotterSatchel_SupArmor X2WeaponUpgradeTemplate]
FriendlyName="终极侦察兵包"
FriendlyNamePlural="终极侦察兵包"
BriefSummary="增加战场扫描器携带量 3."
TinySummary="增加战场扫描器携带量"
LootToolTip="武器部件只用于护甲，提升携带战场扫描器数量。"

[GrimyRiotHarness_BscArmor X2WeaponUpgradeTemplate]
FriendlyName="混乱背带"
FriendlyNamePlural="混乱背带"
BriefSummary="闪光榴弹携弹量 +1，闪光榴弹伤害 +1."
TinySummary="增加闪光榴弹携带量和伤害"
LootToolTip="武器部件只用于护甲，提升携带闪光榴弹数量。"

[GrimyRiotHarness_AdvArmor X2WeaponUpgradeTemplate]
FriendlyName="高级混乱背带"
FriendlyNamePlural="高级混乱背带"
BriefSummary="闪光榴弹携弹量 +1，闪光榴弹伤害 +2."
TinySummary="增加闪光榴弹携带量和伤害"
LootToolTip="武器部件只用于护甲，提升携带闪光榴弹数量。"

[GrimyRiotHarness_SupArmor X2WeaponUpgradeTemplate]
FriendlyName="终极混乱背带"
FriendlyNamePlural="终极混乱背带"
BriefSummary="闪光榴弹携弹量 +1，闪光榴弹伤害 +3."
TinySummary="增加闪光榴弹携带量和伤害"
LootToolTip="武器部件只用于护甲，提升携带闪光榴弹数量。"

[GrimyRageStimulant_BscArmor X2WeaponUpgradeTemplate]
FriendlyName="狂怒注射药"
FriendlyNamePlural="狂怒注射药"
BriefSummary="受伤时提高命中和暴击率 10% 。"
TinySummary="受伤时提高命中和暴击率"
LootToolTip="武器部件只用于护甲，受伤时提高命中和暴击率。"

[GrimyRageStimulant_AdvArmor X2WeaponUpgradeTemplate]
FriendlyName="高级狂怒注射药"
FriendlyNamePlural="高级狂怒注射药"
BriefSummary="受伤时提高命中和暴击率 15% 。"
TinySummary="受伤时提高命中和暴击率"
LootToolTip="武器部件只用于护甲，受伤时提高命中和暴击率。"

[GrimyRageStimulant_SupArmor X2WeaponUpgradeTemplate]
FriendlyName="终极狂怒注射药"
FriendlyNamePlural="终极狂怒注射药"
BriefSummary="受伤时提高命中和暴击率 20% 。"
TinySummary="受伤时提高命中和暴击率"
LootToolTip="武器部件只用于护甲，受伤时提高命中和暴击率。"

[GrimyStimplant_BscArmor X2WeaponUpgradeTemplate]
FriendlyName="兴奋剂"
FriendlyNamePlural="兴奋剂"
BriefSummary="每任务 1 次，移动力 +3，护甲 +3，持续 1 回合。"
TinySummary="提升移动力和护甲"
LootToolTip="武器部件只用于护甲，临时提升移动力和护甲。"

[GrimyStimplant_AdvArmor X2WeaponUpgradeTemplate]
FriendlyName="高级兴奋剂"
FriendlyNamePlural="高级兴奋剂"
BriefSummary="每任务 1 次，移动力 +3，护甲 +4，持续 1 回合。"
TinySummary="提升移动力和护甲"
LootToolTip="武器部件只用于护甲，临时提升移动力和护甲。"

[GrimyStimplant_SupArmor X2WeaponUpgradeTemplate]
FriendlyName="终极兴奋剂"
FriendlyNamePlural="终极兴奋剂"
BriefSummary="每任务 1 次，移动力 +3，护甲 +5，持续 1 回合。"
TinySummary="提升移动力和护甲"
LootToolTip="武器部件只用于护甲，临时提升移动力和护甲。"

[GrimyReactiveServos_BscArmor X2WeaponUpgradeTemplate]
FriendlyName="反应放大"
FriendlyNamePlural="反应放大"
BriefSummary="提升监视命中 5%，可使用主武器反击攻击者。"
TinySummary="反击"
LootToolTip="武器部件只用于护甲，提升监视命中，可使用主武器反击攻击者。"

[GrimyReactiveServos_AdvArmor X2WeaponUpgradeTemplate]
FriendlyName="高级反应放大"
FriendlyNamePlural="高级反应放大"
BriefSummary="提升监视命中 10%，可使用主武器反击攻击者。"
TinySummary="反击"
LootToolTip="武器部件只用于护甲，提升监视命中，可使用主武器反击攻击者。"

[GrimyReactiveServos_SupArmor X2WeaponUpgradeTemplate]
FriendlyName="终极反应放大"
FriendlyNamePlural="终极反应放大"
BriefSummary="提升监视命中 15%，可使用主武器反击攻击者。"
TinySummary="反击"
LootToolTip="武器部件只用于护甲，提升监视命中，可使用主武器反击攻击者。"

[GrimyAbsorptionField_BscArmor X2WeaponUpgradeTemplate]
FriendlyName="吸收力场"
FriendlyNamePlural="吸收力场"
BriefSummary="任何攻击伤害超过被攻击者最大HP的 40%，将被强制吸收多余的伤害。"
TinySummary="伤害限制"
LootToolTip="武器部件只用于护甲，防止使用者受到较大伤害。"

[GrimyAbsorptionField_AdvArmor X2WeaponUpgradeTemplate]
FriendlyName="高级吸收力场"
FriendlyNamePlural="高级吸收力场"
BriefSummary="任何攻击伤害超过被攻击者最大HP的 35%，将被强制吸收多余的伤害。"
TinySummary="伤害限制"
LootToolTip="武器部件只用于护甲，防止使用者受到较大伤害。"

[GrimyAbsorptionField_SupArmor X2WeaponUpgradeTemplate]
FriendlyName="终极吸收力场"
FriendlyNamePlural="终极吸收力场"
BriefSummary="任何攻击伤害超过被攻击者最大HP的 30%，将被强制吸收多余的伤害。"
TinySummary="伤害限制"
LootToolTip="武器部件只用于护甲，防止使用者受到较大伤害。"

[GrimyShieldGate_BscArmor X2WeaponUpgradeTemplate]
FriendlyName="大巴车"
FriendlyNamePlural="大巴车"
BriefSummary="提供 1 绝对护盾值, 使用者在绝对护盾值被消耗前不掉血。"
TinySummary="大巴不止出现在足球场"
LootToolTip="武器部件只用于护甲，提供绝对护盾值保护士兵不受伤害。"

[GrimyShieldGate_AdvArmor X2WeaponUpgradeTemplate]
FriendlyName="高级大巴车"
FriendlyNamePlural="高级大巴车"
BriefSummary="提供 2 绝对护盾值, 使用者在绝对护盾值被消耗前不掉血。"
TinySummary="大巴不止出现在足球场"
LootToolTip="武器部件只用于护甲，提供绝对护盾值保护士兵不受伤害。"

[GrimyShieldGate_SupArmor X2WeaponUpgradeTemplate]
FriendlyName="终极大巴车"
FriendlyNamePlural="终极大巴车"
BriefSummary="提供 3 绝对护盾值, 使用者在绝对护盾值被消耗前不掉血。"
TinySummary="大巴不止出现在足球场"
LootToolTip="武器部件只用于护甲，提供绝对护盾值保护士兵不受伤害。"

[GrimyStimplant3 X2AbilityTemplate]
LocFriendlyName="兴奋剂"
LocHelpText="移动力 +3，护甲 +3，持续 1 回合。"

[GrimyStimplant4 X2AbilityTemplate]
LocFriendlyName="兴奋剂"
LocHelpText="移动力 +3，护甲 +4，持续 1 回合。"

[GrimyStimplant5 X2AbilityTemplate]
LocFriendlyName="兴奋剂"
LocHelpText="移动力 +3，护甲 +5，持续 1 回合。"

[GrimyShieldBattery1 X2AbilityTemplate]
LocFriendlyName="护盾电池"
LocHelpText="提供 5 护盾值，持续 3 回合。"

[GrimyShieldBattery2 X2AbilityTemplate]
LocFriendlyName="护盾电池"
LocHelpText="提供 5 护盾值，持续 3 回合。"

[GrimyShieldBattery3 X2AbilityTemplate]
LocFriendlyName="护盾电池"
LocHelpText="提供 5 护盾值，持续 3 回合。"

[GrimyLegServos1 X2AbilityTemplate]
LocFriendlyName="飞毛腿"
LocHelpText="移动力 +3，持续 1 回合。"

[GrimyLegServos2 X2AbilityTemplate]
LocFriendlyName="飞毛腿"
LocHelpText="移动力 +3，持续 1 回合。"

[GrimyLegServos3 X2AbilityTemplate]
LocFriendlyName="飞毛腿"
LocHelpText="移动力 +3，持续 1 回合。"

[GrimyInjuredBonus10 X2AbilityTemplate]
LocFriendlyName="狂怒注射药"

[GrimyInjuredBonus15 X2AbilityTemplate]
LocFriendlyName="狂怒注射药"

[GrimyInjuredBonus20 X2AbilityTemplate]
LocFriendlyName="狂怒注射药"

[GrimyBonusCrit10Sword X2AbilityTemplate]
LocFriendlyName="锯齿刀锋"

[GrimyBonusCrit20Sword X2AbilityTemplate]
LocFriendlyName="锯齿刀锋"

[GrimyBonusCrit30Sword X2AbilityTemplate]
LocFriendlyName="锯齿刀锋"

[GrimyBonusCrit10GL X2AbilityTemplate]
LocFriendlyName="液体炸药"

[GrimyBonusCrit15GL X2AbilityTemplate]
LocFriendlyName="液体炸药"

[GrimyBonusCrit20GL X2AbilityTemplate]
LocFriendlyName="液体炸药"

[GrimyVitalPoint_Bsc X2AbilityTemplate]
LocFriendlyName="要害瞄准"

[GrimyVitalPoint_Adv X2AbilityTemplate]
LocFriendlyName="高级要害瞄准"

[GrimyVitalPoint_Sup X2AbilityTemplate]
LocFriendlyName="终级要害瞄准"

[GrimyDecreaseAim_Bsc X2AbilityTemplate]
LocFriendlyName="重铀"

[GrimyDecreaseAim_Adv X2AbilityTemplate]
LocFriendlyName="高级重铀"

[GrimyDecreaseAim_Sup X2AbilityTemplate]
LocFriendlyName="终极重铀"

[GrimyFrontload_Bsc X2AbilityTemplate]
LocFriendlyName="前负荷弹匝"

[GrimyFrontload_Adv X2AbilityTemplate]
LocFriendlyName="高级前负荷弹匝"

[GrimyFrontload_Sup X2AbilityTemplate]
LocFriendlyName="终极前负荷弹匝"

[GrimyReserve_Bsc X2AbilityTemplate]
LocFriendlyName="后负荷弹匝"

[GrimyReserve_Adv X2AbilityTemplate]
LocFriendlyName="高级后负荷弹匝"

[GrimyReserve_Sup X2AbilityTemplate]
LocFriendlyName="终极后负荷弹匝"

[GrimyHangfire_Bsc X2AbilityTemplate]
LocFriendlyName="延时引信"

[GrimyHangfire_Adv X2AbilityTemplate]
LocFriendlyName="高级延时引信"

[GrimyHangfire_Sup X2AbilityTemplate]
LocFriendlyName="终极延时引信"

[GrimyHighCycle_Bsc X2AbilityTemplate]
LocFriendlyName="高旋枪管"

[GrimyHighCycle_Adv X2AbilityTemplate]
LocFriendlyName="高级高旋枪管"

[GrimyHighCycle_Sup X2AbilityTemplate]
LocFriendlyName="终极高旋枪管"

[GrimyMaxCaliber_Crit X2AbilityTemplate]
LocFriendlyName="最大口径弹药"

[GrimyBigGameHunter_BscSword' X2AbilityTemplate]
LocFriendlyName="猎人本色"

[GrimyBigGameHunter_AdvSword' X2AbilityTemplate]
LocFriendlyName="高级猎人本色"

[GrimyBigGameHunter_SupSword' X2AbilityTemplate]
LocFriendlyName="终极猎人本色"

[GrimyRedDot_Bsc X2AbilityTemplate]
LocFriendlyName="红点瞄准"

[GrimyRedDot_Adv X2AbilityTemplate]
LocFriendlyName="高级红点瞄准"

[GrimyRedDot_Sup X2AbilityTemplate]
LocFriendlyName="终极红点瞄准"

[GrimyRedDot_BscPistol X2AbilityTemplate]
LocFriendlyName="红点瞄准"

[GrimyRedDot_AdvPistol X2AbilityTemplate]
LocFriendlyName="高级红点瞄准"

[GrimyRedDot_SupPistol X2AbilityTemplate]
LocFriendlyName="终极红点瞄准"

;---------------------------------------------
;---               WEAPONS                 ---
;---------------------------------------------
[Gremlin_CV X2GremlinTemplate]
BriefSummary="小精灵无人机能让专家在一个安全的距离外开展多样的战场任务。"

[PsiAmp_CV X2WeaponTemplate]
BriefSummary="灵能增幅器让灵能士兵发动灵能能力。"

[SparkBit_CV X2WeaponTemplate]
BriefSummary="BIT允许SPARK在安全距离进行多种战地任务。"

[SparkBit_MG X2WeaponTemplate]
BriefSummary="BIT允许SPARK在安全距离进行多种战地任务。"

[SparkBit_BM X2WeaponTemplate]
BriefSummary="BIT允许SPARK在安全距离进行多种战地任务。"
;---------------------------------------------
;---               RESEARCH                ---
;---------------------------------------------

[Tech_IdentifyRareLockbox X2TechTemplate]
DisplayName="解码变种人保险箱"
Summary="变种人已经确保它们的武器可以爆炸, 但是它们最先进的技术都保持在加密的保险箱里。我们的科研人员科研骇入保险箱, 这需要一点时间。"
CodeName="德卡德"
LongDescription="变种人已经确保它们的武器可以爆炸, 但是它们最先进的技术都保持在加密的保险箱里。我们的科研人员科研骇入保险箱, 这需要一点时间。"
UnlockedDescription="<XGParam:StrValue0/!ItemName/>"

[Tech_IdentifyEpicLockbox X2TechTemplate]
DisplayName="解码外星人强力保险箱"
Summary="外星人拥有比变种人更高级的加密技术。打开这个装置不是一件简单的事。"
CodeName="潘多拉"
LongDescription="外星人拥有比变种人更高级的加密技术。打开这个装置不是一件简单的事。"
UnlockedDescription="<XGParam:StrValue0/!ItemName/>"

[Tech_IdentifyLegendaryLockbox X2TechTemplate]
DisplayName="解密外星遗物箱"
Summary="这个装置需要变种人灵能网络提供代码。骇入网络需要很长时间，希望里面的东西物有所值。"
CodeName="赫拉迪姆"
LongDescription="这个装置需要变种人灵能网络提供代码。骇入网络需要很长时间，希望里面的东西物有所值。"
UnlockedDescription="<XGParam:StrValue0/!ItemName/>"

[Tech_IdentifyEpicLockboxInstant X2TechTemplate]
DisplayName="暴力解码外星人强力保险箱"
Summary="外星人拥有比变种人更高级的加密技术。打开这个装置不是一件简单的事。"
CodeName="潘多拉"
LongDescription="外星人拥有比变种人更高级的加密技术。打开这个装置不是一件简单的事。"
UnlockedDescription="<XGParam:StrValue0/!ItemName/>"

[Tech_IdentifyLegendaryLockboxInstant X2TechTemplate]
DisplayName="暴力解密外星遗物箱"
Summary="这个装置需要变种人灵能网络提供代码。骇入网络需要很长时间，希望里面的东西物有所值。"
CodeName="赫拉迪姆"
LongDescription="这个装置需要变种人灵能网络提供代码。骇入网络需要很长时间，希望里面的东西物有所值。"
UnlockedDescription="<XGParam:StrValue0/!ItemName/>"

;---------------------------------------------
;---               ARTIFACTS               ---
;---------------------------------------------
[GrimyUnidentifiedLockboxRare X2ItemTemplate]
FriendlyName="变种人保险箱"
FriendlyNamePlural="变种人保险箱"
BriefSummary="变种人已经确保它们的武器可以爆炸, 但是它们最先进的技术都保持在加密的保险箱里。我们的科研人员科研骇入保险箱, 这需要一点时间。"

[GrimyUnidentifiedLockboxEpic X2ItemTemplate]
FriendlyName="外星人强力保险箱"
FriendlyNamePlural="外星人强力保险箱"
BriefSummary="外星人拥有比变种人更高级的加密技术。打开这个装置不是一件简单的事。"

[GrimyUnidentifiedLockboxLegendary X2ItemTemplate]
FriendlyName="外星遗物箱"
FriendlyNamePlural="外星遗物箱"
BriefSummary="这个装置需要变种人灵能网络提供代码。骇入网络需要很长时间，希望里面的东西物有所值。"